morfredus/ESP32-Diagnostic-Arduino-IDE/ESP32-Diagnostic.ino
/*
 * ESP32 Diagnostic Suite v3.4.03-dev
 * Compatible: ESP32, ESP32-S2, ESP32-S3, ESP32-C3, ESP32-C6, ESP32-H2
 * Optimisé pour ESP32 Arduino Core 3.3.2
 * Carte testée: ESP32-S3 avec PSRAM OPI
 * Auteur: morfredus
 */

#if defined(__GNUC__)
  #define DIAGNOSTIC_UNUSED __attribute__((unused))
#else
  #define DIAGNOSTIC_UNUSED
#endif

static const char* const DIAGNOSTIC_VERSION_HISTORY[] DIAGNOSTIC_UNUSED = {
  "3.4.03-dev - Traduction dynamique des actions écran OLED",
  "3.4.02-dev - Repli HTTP automatique si HTTPS indisponible",
  "3.4.01-dev - Préférence HTTPS et repli intelligent",
  "3.4.0 - Stabilisation JSON et documentation 3.4.x",
  "3.4.0-dev - Nettoyage des commentaires et harmonisation Bluetooth",
  "3.3.10-dev - Prototypes des helpers JSON mutualisés",
  "3.3.09-dev - Unification des handlers périphériques",
  "3.3.08-dev - Correctifs compilation helpers JSON",
  "3.3.07-dev - Mutualisation des réponses HTTP JSON",
  "3.3.06-dev - Corrections des retours String après optimisation de la traduction",
  "3.3.05-dev - Levée de l'ambiguïté String/const char* des traductions",
  "3.3.04-dev - Conversion String pour la table de traduction",
  "3.3.03-dev - Optimisation de la table de traduction",
  "3.3.02-dev - Harmonisation bilingue des libellés UI",
  "3.3.01-dev - Retrait du diagnostic touchpad devenu obsolète",
  "3.2.21-maint - Nettoyage des bannières et consolidation de l'historique",
  "3.2.20-dev - Correction de l'attribut data-i18n dans appendInfoItem",
  "3.2.19-dev - Correction de la collision tr() lors du changement de langue",
  "3.2.18-dev - Suppression du double échappement JS dynamique",
  "3.2.17-dev - Correction des chaînes JS des tests dynamiques",
  "3.2.16-dev - Localisation étendue des chaînes UI dynamiques",
  "3.2.15-dev - Réduction du gabarit HTML et allègement du sketch",
  "3.2.14-dev - Harmonisation des traductions UI dynamiques",
  "3.2.13-dev - Retrait final du doublon IP sur le bandeau legacy",
  "3.2.12-dev - Bandeau sans doublon IP",
  "3.2.11-dev - Bandeau d'accès compact et lien IP unique",
  "3.2.10-dev - Pré-configuration du nom d'hôte mDNS avant le WiFi",
  "3.2.09-dev - Restauration complète de mDNS sur ESP32-S3",
  "3.2.08-dev - Correction de l'initialisation WiFi pour mDNS",
  "3.2.07-dev - Compatibilité mDNS multi-environnements",
  "3.2.06-dev - Restauration mDNS fiable et lien d'accès constant",
  "3.2.05-dev - Suppression du service mDNS instable",
  "3.2.04-dev - Reconstruction du serveur mDNS",
  "3.2.02-dev - Ajustement du maintien mDNS sans appel update()",
  "3.2.01-dev - Correction de la publication mDNS",
  "3.2.0-doc - Consolidation des guides après la campagne de tests",
  "3.1.19-doc - Scission du changelog FR/EN et rafraîchissement de la documentation",
  "3.1.18-doc - Documentation 3.1.18 et durcissement du changement de langue",
  "3.1.17-maint - Nettoyage de commentaires superflus et renforcement de la sélection de langue",
  "3.1.16 - Bandeau sticky unifié et correctifs navigation/traductions",
  "3.1.15-maint - Harmonisation de la documentation et rappel des libellés par défaut",
  "3.1.14-maint - Corrections de messages d'état et amélioration de l'échappement HTML",
  "3.1.13-dev - Bandeau sticky unifié et retrait du test tactile des exports",
  "3.1.12-dev - Alignement du numéro de version dans le bandeau principal"
};

#undef DIAGNOSTIC_UNUSED

#include <WiFi.h>
#include <WiFiMulti.h>
#include <WebServer.h>

#if defined(ARDUINO_ARCH_ESP32)
  #if defined(__has_include)
    #if __has_include(<ESPmDNS.h>)
      #include <ESPmDNS.h>
      #define DIAGNOSTIC_HAS_MDNS 1
      #define DIAGNOSTIC_USES_ESPMDNS 1
    #elif __has_include(<mdns.h>)
      #include <mdns.h>
      #define DIAGNOSTIC_HAS_MDNS 1
      #define DIAGNOSTIC_USES_IDF_MDNS 1
    #else
      #define DIAGNOSTIC_HAS_MDNS 0
    #endif
  #else
    #include <ESPmDNS.h>
    #define DIAGNOSTIC_HAS_MDNS 1
    #define DIAGNOSTIC_USES_ESPMDNS 1
  #endif
#else
  #define DIAGNOSTIC_HAS_MDNS 0
#endif

#if !defined(DIAGNOSTIC_HAS_MDNS)
  #define DIAGNOSTIC_HAS_MDNS 0
#endif

#if DIAGNOSTIC_HAS_MDNS && defined(DIAGNOSTIC_USES_ESPMDNS)
  #if defined(NO_GLOBAL_MDNS) || defined(NO_GLOBAL_INSTANCES)
    static MDNSResponder diagnosticMDNSResponder;
    #define DIAGNOSTIC_MDNS_SERVER diagnosticMDNSResponder
  #else
    #define DIAGNOSTIC_MDNS_SERVER MDNS
  #endif
#endif
#include <esp_chip_info.h>
#include <esp_err.h>
#include <esp_mac.h>
#include <esp_flash.h>
#include <esp_heap_caps.h>
#include <esp_partition.h>
#include <esp_wifi.h>
#if defined(__has_include)
  #if __has_include(<esp_netif.h>)
    #include <esp_netif.h>
    #define DIAGNOSTIC_HAS_ESP_NETIF 1
  #endif
  #if __has_include(<tcpip_adapter.h>)
    #include <tcpip_adapter.h>
    #define DIAGNOSTIC_HAS_TCPIP_ADAPTER 1
  #endif
#else
  #include <esp_netif.h>
  #define DIAGNOSTIC_HAS_ESP_NETIF 1
#endif
#include <soc/soc.h>
#include <soc/rtc.h>
#if defined(__has_include)
  #if __has_include(<soc/soc_caps.h>)
    #include <soc/soc_caps.h>
  #endif
#else
  #include <soc/soc_caps.h>
#endif
#include <Wire.h>
#include <Adafruit_NeoPixel.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>

#define BLE_STACK_SUPPORTED 1

#if defined(SOC_BLE_SUPPORTED)
  static const bool TARGET_BLE_SUPPORTED = (SOC_BLE_SUPPORTED);
#elif defined(CONFIG_IDF_TARGET_ESP32S3) || defined(CONFIG_IDF_TARGET_ESP32C3) || \
      defined(CONFIG_IDF_TARGET_ESP32C6) || defined(CONFIG_IDF_TARGET_ESP32H2)
  static const bool TARGET_BLE_SUPPORTED = true;
#elif defined(CONFIG_IDF_TARGET_ESP32S2)
  static const bool TARGET_BLE_SUPPORTED = false;
#elif defined(ARDUINO_ARCH_ESP32)
  #if defined(ARDUINO_ESP32S2_DEV) || defined(ARDUINO_LOLIN_S2_MINI) || defined(ARDUINO_LILYGO_T_DISPLAY_S2) || \
      defined(ARDUINO_TINYPICO_S2) || defined(ARDUINO_TINYS2) || defined(ARDUINO_QTPY_ESP32S2)
    static const bool TARGET_BLE_SUPPORTED = false;
  #else
    static const bool TARGET_BLE_SUPPORTED = true;
  #endif
#else
    static const bool TARGET_BLE_SUPPORTED = true;
#endif
#include <vector>
#include <cstring>
#include <initializer_list>
#include "json_helpers.h"

#if defined(__has_include)
  #if __has_include("wifi-config.h")
    #include "wifi-config.h"
  #elif __has_include("wifi-config-example.h")
    #include "wifi-config-example.h"
  #else
    #error "Aucun fichier de configuration WiFi disponible"
  #endif
#else
  #include "wifi-config.h"
#endif

// Système de traduction
#include "languages.h"

Language currentLanguage = LANG_FR;

static String buildActionResponseJson(bool success,
                                      const String& message,
                                      std::initializer_list<JsonFieldSpec> extraFields = {});
inline void sendActionResponse(int statusCode,
                               bool success,
                               const String& message,
                               std::initializer_list<JsonFieldSpec> extraFields = {});
inline void sendOperationSuccess(const String& message,
                                 std::initializer_list<JsonFieldSpec> extraFields = {});
inline void sendOperationError(int statusCode,
                               const String& message,
                               std::initializer_list<JsonFieldSpec> extraFields = {});

#if defined(__has_include)
  #if __has_include(<esp_arduino_version.h>)
    #include <esp_arduino_version.h>
  #endif
#endif

#ifndef ESP_ARDUINO_VERSION_VAL
#define ESP_ARDUINO_VERSION_VAL(major, minor, patch) ((major << 16) | (minor << 8) | (patch))
#endif

#ifndef ESP_ARDUINO_VERSION
#if defined(ESP_ARDUINO_VERSION_MAJOR) && defined(ESP_ARDUINO_VERSION_MINOR) && defined(ESP_ARDUINO_VERSION_PATCH)
#define ESP_ARDUINO_VERSION ESP_ARDUINO_VERSION_VAL(ESP_ARDUINO_VERSION_MAJOR, ESP_ARDUINO_VERSION_MINOR, ESP_ARDUINO_VERSION_PATCH)
#else
#define ESP_ARDUINO_VERSION ESP_ARDUINO_VERSION_VAL(0, 0, 0)
#endif
#endif

// ========== CONFIGURATION ==========
#define DIAGNOSTIC_VERSION "3.4.03-dev"
#define DIAGNOSTIC_HOSTNAME "esp32-diagnostic"
#define CUSTOM_LED_PIN -1
#define CUSTOM_LED_COUNT 1
#define ENABLE_I2C_SCAN true
const char* DIAGNOSTIC_VERSION_STR = DIAGNOSTIC_VERSION;

// --- [BUGFIX] Préférence HTTPS contrôlable ---
#if !defined(DIAGNOSTIC_PREFER_SECURE)
#define DIAGNOSTIC_PREFER_SECURE 0
#endif
const char* const DIAGNOSTIC_SECURE_SCHEME = "https://";
const char* const DIAGNOSTIC_LEGACY_SCHEME = "http://";

