morfredus/ESP32-Diagnostic-Arduino-IDE/ESP32-Diagnostic.ino
String jsonEscape(const char* raw) {
  if (raw == nullptr) {
    return "";
  }

  const size_t rawLength = strlen(raw);
  String escaped;
  escaped.reserve(rawLength * 2);
  while (*raw) {
    char c = *raw++;
    switch (c) {
      case '\\':
        escaped += "\\\\";
        break;
      case '"':
        escaped += "\\\"";
        break;
      case '\n':
        escaped += "\\n";
        break;
      case '\r':
        escaped += "\\r";
        break;
      case '\t':
        escaped += "\\t";
        break;
      default:
        escaped += c;
        break;
    }
  }
  return escaped;
}

static inline void appendJsonField(String& json, bool& first, const JsonFieldSpec& field) {
  if (!first) {
    json += ',';
  }
  first = false;
  json += '"';
  json += field.key;
  json += '"';
  json += ':';
  if (field.raw) {
    json += field.value;
  } else {
    json += '"';
    json += jsonEscape(field.value.c_str());
    json += '"';
  }
}

String buildJsonObject(std::initializer_list<JsonFieldSpec> fields) {
  String json = "{";
  bool first = true;
  for (const auto& field : fields) {
    appendJsonField(json, first, field);
  }
  json += '}';
  return json;
}

inline void sendJsonResponse(int statusCode, std::initializer_list<JsonFieldSpec> fields) {
  server.send(statusCode, "application/json", buildJsonObject(fields));
}

static String buildActionResponseJson(bool success,
                                      const String& message,
                                      std::initializer_list<JsonFieldSpec> extraFields) {
  String json = "{";
  bool first = true;
  appendJsonField(json, first, jsonBoolField("success", success));
  if (message.length() > 0) {
    appendJsonField(json, first, jsonStringField("message", message));
  }
  for (const auto& field : extraFields) {
    appendJsonField(json, first, field);
  }
  json += '}';
  return json;
}

inline void sendActionResponse(int statusCode,
                               bool success,
                               const String& message,
                               std::initializer_list<JsonFieldSpec> extraFields) {
  server.send(statusCode, "application/json", buildActionResponseJson(success, message, extraFields));
}

inline void sendOperationSuccess(const String& message,
                                 std::initializer_list<JsonFieldSpec> extraFields) {
  sendActionResponse(200, true, message, extraFields);
}

inline void sendOperationError(int statusCode,
                               const String& message,
                               std::initializer_list<JsonFieldSpec> extraFields) {
  sendActionResponse(statusCode, false, message, extraFields);
}

static inline void appendInfoItem(String& chunk,
                                  const char* labelKey,
                                  const char* labelText,
                                  const String& valueText,
                                  const String& valueAttrs = String(),
                                  const String& wrapperAttrs = String()) {
  chunk += F("<div class='info-item'");
  if (wrapperAttrs.length() > 0) {
    chunk += ' ';
    chunk += wrapperAttrs;
  }
  chunk += F("><div class='info-label");
  if (labelKey != nullptr && labelKey[0] != '\0') {
    // --- [FIX] Attribut data-i18n correctement concaténé ---
    chunk += F(" data-i18n='");
    chunk += labelKey;
    chunk += F("'>");
  } else {
    chunk += F("'>");
  }
  chunk += labelText;
  chunk += F("</div><div class='info-value'");
  if (valueAttrs.length() > 0) {
    chunk += ' ';
    chunk += valueAttrs;
  }
  chunk += F(">");
  chunk += valueText;
  chunk += F("</div></div>");
}

String jsonField(const char* key, const char* value, bool last = false) {
  String field = "\"";
  field += key;
  field += "\":\"";
  field += jsonEscape(value);
  field += last ? "\"" : "\",";
  return field;
}

String sanitizeBluetoothName(const String& raw) {
  String cleaned;
  cleaned.reserve(raw.length());
  for (size_t i = 0; i < raw.length(); ++i) {
    char c = raw[i];
    if (c >= 32 && c != 127) {
      cleaned += c;
    }
    if (cleaned.length() >= 29) {
      break;
    }
  }
  cleaned.trim();
  return cleaned;
}

void ensureBluetoothName() {
  if (bluetoothDeviceName.length() == 0) {
    bluetoothDeviceName = defaultBluetoothName.length() > 0 ? defaultBluetoothName : String("ESP32 Diagnostic");
  }
}

void syncBluetoothDiagnostics() {
  ensureBluetoothName();

  bool supported = bluetoothCapable;
  bool hasRadio = bluetoothCapable || diagnosticData.hasBLE || diagnosticData.hasBT;
  diagnosticData.bluetoothName = bluetoothDeviceName;
  diagnosticData.bluetoothEnabled = supported && bluetoothEnabled;
  diagnosticData.bluetoothAdvertising = supported && (bluetoothAdvertising
#if BLE_STACK_SUPPORTED
      || bluetoothClientConnected
#endif
  );

  if (hasRadio) {
    uint8_t mac[6] = {0};
    if (esp_read_mac(mac, ESP_MAC_BT) == ESP_OK) {
      char macStr[18];
      sprintf(macStr, "%02X:%02X:%02X:%02X:%02X:%02X",
              mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
      diagnosticData.bluetoothAddress = String(macStr);
    } else {
      diagnosticData.bluetoothAddress = String("--:--:--:--:--:--");
    }
  } else {
    diagnosticData.bluetoothAddress = String("--:--:--:--:--:--");
  }
}

String getBluetoothStateLabel() {
  if (!bluetoothCapable) {
    return String(T().bluetooth_not_supported);
  }
  if (!bluetoothEnabled) {
    return String(T().bluetooth_disabled);
  }
#if BLE_STACK_SUPPORTED
  if (bluetoothClientConnected) {
    return String(T().bluetooth_enabled);
  }
#endif
  if (bluetoothAdvertising) {
    return String(T().bluetooth_advertising);
  }
  return String(T().bluetooth_not_advertising);
}

String getBluetoothSummaryLabel() {
  if (!bluetoothCapable) {
    return String(T().bluetooth_not_supported);
  }
  if (!bluetoothEnabled) {
    return String(T().bluetooth_disabled);
  }

  ensureBluetoothName();
  String summary = bluetoothDeviceName;
  summary += " • ";
#if BLE_STACK_SUPPORTED
  if (bluetoothClientConnected) {
    summary += String(T().bluetooth_enabled);
  } else
#endif
  {
    summary += bluetoothAdvertising ? String(T().bluetooth_advertising) : String(T().bluetooth_not_advertising);
  }
  return summary;
}

String buildBluetoothJSON(bool success, const String& message) {
  syncBluetoothDiagnostics();

  String json = "{";
  json += "\"success\":" + String(success ? "true" : "false") + ",";
  json += "\"supported\":" + String(bluetoothCapable ? "true" : "false") + ",";
  json += "\"enabled\":" + String((bluetoothCapable && bluetoothEnabled) ? "true" : "false") + ",";
  json += "\"advertising\":" + String((bluetoothCapable && bluetoothAdvertising) ? "true" : "false") + ",";
  json += "\"name\":\"" + jsonEscape(bluetoothDeviceName.c_str()) + "\",";
  json += "\"mac\":\"" + jsonEscape(diagnosticData.bluetoothAddress.c_str()) + "\",";
  String status = getBluetoothStateLabel();
  json += "\"status\":\"" + jsonEscape(status.c_str()) + "\",";
  String summary = getBluetoothSummaryLabel();
  json += "\"summary\":\"" + jsonEscape(summary.c_str()) + "\",";
  json += "\"message\":\"" + jsonEscape(message.c_str()) + "\"";
  json += "}";
  return json;
}

