morfredus/ESP32-Diagnostic-Arduino-IDE/ESP32-Diagnostic.ino
#if BLE_STACK_SUPPORTED
void dispatchBluetoothTelemetry() {
  if (!bluetoothEnabled || !bluetoothClientConnected || !bluetoothCharacteristic) {
    return;
  }

  unsigned long now = millis();
  if (now - lastBluetoothNotify < 2000) {
    return;
  }

  lastBluetoothNotify = now;
  bluetoothNotifyCounter++;

  unsigned long uptimeSeconds = diagnosticData.uptime / 1000UL;
  char payload[96];
  int written = snprintf(payload, sizeof(payload),
                         "Diag %lu | Uptime %lus",
                         static_cast<unsigned long>(bluetoothNotifyCounter),
                         static_cast<unsigned long>(uptimeSeconds));
  if (written < 0) {
    return;
  }

  size_t length = (written >= static_cast<int>(sizeof(payload))) ? sizeof(payload) - 1 : static_cast<size_t>(written);
  if (length == 0) {
    return;
  }
  bluetoothCharacteristic->setValue(reinterpret_cast<uint8_t*>(payload), length);
  bluetoothCharacteristic->notify();
  Serial.printf("[BLE] Notification #%lu envoyée (%lus)\n",
                static_cast<unsigned long>(bluetoothNotifyCounter),
                static_cast<unsigned long>(uptimeSeconds));
}
#endif

bool startBluetooth() {
  ensureBluetoothName();

  if (!bluetoothCapable) {
    bluetoothEnabled = false;
    bluetoothAdvertising = false;
#if BLE_STACK_SUPPORTED
    bluetoothClientConnected = false;
    bluetoothNotifyCounter = 0;
    lastBluetoothNotify = 0;
#endif
    return false;
  }

#if BLE_STACK_SUPPORTED
  if (bluetoothAdvertising) {
    bluetoothEnabled = true;
    return true;
  }

  BLEDevice::init(bluetoothDeviceName.c_str());
  bluetoothServer = BLEDevice::createServer();
  if (!bluetoothServer) {
    bluetoothEnabled = false;
    bluetoothAdvertising = false;
    bluetoothClientConnected = false;
    bluetoothNotifyCounter = 0;
    lastBluetoothNotify = 0;
    return false;
  }

  bluetoothServer->setCallbacks(new DiagnosticBLECallbacks());

  bluetoothService = bluetoothServer->createService(BLEUUID(DIAG_BLE_SERVICE_UUID));
  if (!bluetoothService) {
    BLEDevice::deinit(true);
    bluetoothServer = nullptr;
    bluetoothEnabled = false;
    bluetoothAdvertising = false;
    bluetoothClientConnected = false;
    bluetoothNotifyCounter = 0;
    lastBluetoothNotify = 0;
    return false;
  }

  bluetoothCharacteristic = bluetoothService->createCharacteristic(
      BLEUUID(DIAG_BLE_CHARACTERISTIC_UUID),
      BLECharacteristic::PROPERTY_READ | BLECharacteristic::PROPERTY_NOTIFY);
  if (bluetoothCharacteristic) {
    bluetoothCharacteristic->setValue("ESP32 Diagnostic prêt");
    bluetoothCharacteristic->addDescriptor(new BLE2902());
  }

  bluetoothService->start();
  BLEAdvertising* advertising = BLEDevice::getAdvertising();
  if (!advertising) {
    bluetoothService->stop();
    BLEDevice::deinit(true);
    bluetoothServer = nullptr;
    bluetoothService = nullptr;
    bluetoothCharacteristic = nullptr;
    bluetoothEnabled = false;
    bluetoothAdvertising = false;
    bluetoothClientConnected = false;
    bluetoothNotifyCounter = 0;
    lastBluetoothNotify = 0;
    return false;
  }

  advertising->addServiceUUID(BLEUUID(DIAG_BLE_SERVICE_UUID));
  advertising->setScanResponse(true);
  advertising->setMinPreferred(0x06);
  advertising->setMinPreferred(0x12);
  advertising->start();
  BLEDevice::startAdvertising();

  bluetoothEnabled = true;
  bluetoothAdvertising = true;
  bluetoothClientConnected = false;
  bluetoothNotifyCounter = 0;
  lastBluetoothNotify = millis();
  return true;
#else
  return false;
#endif
}

void stopBluetooth() {
#if BLE_STACK_SUPPORTED
  if (bluetoothAdvertising) {
    BLEAdvertising* advertising = BLEDevice::getAdvertising();
    if (advertising) {
      advertising->stop();
    }
  }

  bluetoothClientConnected = false;
  bluetoothNotifyCounter = 0;
  lastBluetoothNotify = 0;

  if (bluetoothService) {
    bluetoothService->stop();
  }
  if (bluetoothServer) {
    bluetoothServer->disconnect(0);
  }

  BLEDevice::deinit(true);
  bluetoothServer = nullptr;
  bluetoothService = nullptr;
  bluetoothCharacteristic = nullptr;
#endif

  bluetoothEnabled = false;
  bluetoothAdvertising = false;
}

void handleGetTranslations() {
  // Envoie toutes les traductions en JSON pour mise à jour dynamique
  String json = "{";
  json.reserve(1024);
  json += jsonField("title", T().title);
  json += jsonField("version", T().version);
  json += jsonField("nav_overview", T().nav_overview);
  json += jsonField("nav_leds", T().nav_leds);
  json += jsonField("nav_screens", T().nav_screens);
  json += jsonField("nav_tests", T().nav_tests);
  json += jsonField("nav_gpio", T().nav_gpio);
  json += jsonField("nav_wireless", T().nav_wireless);
  json += jsonField("nav_benchmark", T().nav_benchmark);
  json += jsonField("nav_export", T().nav_export);
  json += jsonField("nav_select_label", T().nav_select_label);
  json += jsonField("chip_info", T().chip_info);
  json += jsonField("full_model", T().full_model);
  json += jsonField("cpu_cores", T().cpu_cores);
  json += jsonField("mac_wifi", T().mac_wifi);
  json += jsonField("last_reset", T().last_reset);
  json += jsonField("chip_features", T().chip_features);
  json += jsonField("sdk_version", T().sdk_version);
  json += jsonField("idf_version", T().idf_version);
  json += jsonField("uptime", T().uptime);
  json += jsonField("cpu_temp", T().cpu_temp);
  json += jsonField("revision", T().revision);
  json += jsonField("days", T().days);
  json += jsonField("hours", T().hours);
  json += jsonField("minutes", T().minutes);
  json += jsonField("memory_details", T().memory_details);
  json += jsonField("flash_memory", T().flash_memory);
  json += jsonField("real_size", T().real_size);
  json += jsonField("configured_ide", T().configured_ide);
  json += jsonField("configuration", T().configuration);
  json += jsonField("correct", T().correct);
  json += jsonField("to_fix", T().to_fix);
  json += jsonField("flash_type", T().flash_type);
  json += jsonField("flash_speed", T().flash_speed);
  json += jsonField("psram_external", T().psram_external);
  json += jsonField("hardware_status", T().hardware_status);
  json += jsonField("detected_active", T().detected_active);
  json += jsonField("supported_not_enabled", T().supported_not_enabled);
  json += jsonField("ide_config", T().ide_config);
  json += jsonField("total_size", T().total_size);
  json += jsonField("free", T().free);
  json += jsonField("used", T().used);
  json += jsonField("enable_psram_hint", T().enable_psram_hint);
  json += jsonField("not_detected", T().not_detected);
  json += jsonField("internal_sram", T().internal_sram);
  json += jsonField("memory_fragmentation", T().memory_fragmentation);
  json += jsonField("refresh_memory", T().refresh_memory);
  json += jsonField("wifi_connection", T().wifi_connection);
  json += jsonField("connected_ssid", T().connected_ssid);
  json += jsonField("signal_power", T().signal_power);
  json += jsonField("signal_quality", T().signal_quality);
  json += jsonField("ip_address", T().ip_address);
  json += jsonField("subnet_mask", T().subnet_mask);
  json += jsonField("gateway", T().gateway);
  json += jsonField("access", T().access);
  json += jsonField("bluetooth_section", T().bluetooth_section);
  json += jsonField("bluetooth_status", T().bluetooth_status);
  json += jsonField("bluetooth_name", T().bluetooth_name);
  json += jsonField("bluetooth_mac", T().bluetooth_mac);
  json += jsonField("bluetooth_actions", T().bluetooth_actions);
  json += jsonField("bluetooth_enable", T().bluetooth_enable);
  json += jsonField("bluetooth_disable", T().bluetooth_disable);
  json += jsonField("bluetooth_rename", T().bluetooth_rename);
  json += jsonField("bluetooth_reset", T().bluetooth_reset);
  json += jsonField("bluetooth_placeholder", T().bluetooth_placeholder);
  json += jsonField("bluetooth_not_supported", T().bluetooth_not_supported);
  json += jsonField("bluetooth_disabled", T().bluetooth_disabled);
  json += jsonField("bluetooth_enabled", T().bluetooth_enabled);
  json += jsonField("bluetooth_advertising", T().bluetooth_advertising);
  json += jsonField("bluetooth_not_advertising", T().bluetooth_not_advertising);
  json += jsonField("bluetooth_updated", T().bluetooth_updated);
  json += jsonField("bluetooth_error", T().bluetooth_error);
  json += jsonField("bluetooth_reset_done", T().bluetooth_reset_done);
  json += jsonField("bluetooth_support_label", T().bluetooth_support_label);
  json += jsonField("bluetooth_support_yes", T().bluetooth_support_yes);
  json += jsonField("bluetooth_support_no", T().bluetooth_support_no);
  json += jsonField("bluetooth_advertising_label", T().bluetooth_advertising_label);
  json += jsonField("bluetooth_connection_label", T().bluetooth_connection_label);
  json += jsonField("bluetooth_client_connected", T().bluetooth_client_connected);
  json += jsonField("bluetooth_client_disconnected", T().bluetooth_client_disconnected);
  json += jsonField("bluetooth_notifications_label", T().bluetooth_notifications_label);
  json += jsonField("gpio_interfaces", T().gpio_interfaces);
  json += jsonField("total_gpio", T().total_gpio);
  json += jsonField("i2c_peripherals", T().i2c_peripherals);
  json += jsonField("detected_addresses", T().detected_addresses);
  json += jsonField("builtin_led", T().builtin_led);
  json += jsonField("oled_screen", T().oled_screen);
  json += jsonField("adc_test", T().adc_test);
  json += jsonField("pwm_test", T().pwm_test);
  json += jsonField("spi_bus", T().spi_bus);
  json += jsonField("flash_partitions", T().flash_partitions);
  json += jsonField("memory_stress", T().memory_stress);
  json += jsonField("gpio_test", T().gpio_test);
  json += jsonField("test_all_gpio", T().test_all_gpio);
  json += jsonField("click_to_test", T().click_to_test);
  json += jsonField("gpio_warning", T().gpio_warning);
  json += jsonField("i2c_desc", T().i2c_desc);
  json += jsonField("adc_desc", T().adc_desc);
  json += jsonField("pwm_desc", T().pwm_desc);
  json += jsonField("spi_desc", T().spi_desc);
  json += jsonField("partitions_desc", T().partitions_desc);
  json += jsonField("stress_desc", T().stress_desc);
  json += jsonField("gpio_desc", T().gpio_desc);
  json += jsonField("wifi_desc", T().wifi_desc);
  json += jsonField("benchmark_desc", T().benchmark_desc);
  json += jsonField("wifi_scanner", T().wifi_scanner);
  json += jsonField("performance_bench", T().performance_bench);
  json += jsonField("data_export", T().data_export);
  json += jsonField("updating", T().updating);
  json += jsonField("online", T().online);
  json += jsonField("offline", T().offline);
  json += jsonField("check_network", T().check_network);
  json += jsonField("language_updated", T().language_updated);
  json += jsonField("language_switch_error", T().language_switch_error);
  json += jsonField("translation_error", T().translation_error);
  json += jsonField("bluetooth_invalid_name", T().bluetooth_invalid_name);
  json += jsonField("bluetooth_enabling", T().bluetooth_enabling);
  json += jsonField("bluetooth_disabling", T().bluetooth_disabling);
  json += jsonField("bluetooth_updating", T().bluetooth_updating);
  json += jsonField("bluetooth_resetting", T().bluetooth_resetting);
  json += jsonField("loading", T().loading);
  json += jsonField("configuring", T().configuring);
  json += jsonField("reconfiguring", T().reconfiguring);
  json += jsonField("transmission", T().transmission);
  json += jsonField("error_label", T().error_label);
  json += jsonField("test_failed", T().test_failed);
  json += jsonField("gpio_summary_template", T().gpio_summary_template);
  json += jsonField("wifi_networks_found", T().wifi_networks_found);
  json += jsonField("i2c_scan_result", T().i2c_scan_result);
  json += jsonField("gpio_invalid", T().gpio_invalid);
  json += jsonField("configuration_invalid", T().configuration_invalid);
  json += jsonField("oled_test_running", T().oled_test_running, true);
  json += "}";

  server.send(200, "application/json", json);
}

void handleBluetoothStatus() {
  String message = getBluetoothStateLabel();
  server.send(200, "application/json", buildBluetoothJSON(true, message));
}

void handleBluetoothToggle() {
  if (!server.hasArg("state")) {
    server.send(400, "application/json", buildBluetoothJSON(false, String(T().bluetooth_error)));
    return;
  }

