morfredus/ESP32-Diagnostic-Arduino-IDE/ESP32-Diagnostic.ino
  String state = server.arg("state");
  state.toLowerCase();
  bool enable = (state == "on" || state == "1" || state == "true");

  bool supported = bluetoothCapable;
  bool success = false;
  String message;

  if (!supported) {
    message = String(T().bluetooth_not_supported);
  } else if (enable) {
    success = startBluetooth();
    message = success ? String(T().bluetooth_enabled) : String(T().bluetooth_error);
  } else {
    stopBluetooth();
    success = true;
    message = String(T().bluetooth_disabled);
  }

  if (!supported) {
    success = false;
  }

  server.send(200, "application/json", buildBluetoothJSON(success, message));
}

void handleBluetoothName() {
  if (!server.hasArg("name")) {
    server.send(400, "application/json", buildBluetoothJSON(false, String(T().bluetooth_error)));
    return;
  }

  String candidate = sanitizeBluetoothName(server.arg("name"));
  if (candidate.length() == 0) {
    server.send(400, "application/json", buildBluetoothJSON(false, String(T().bluetooth_error)));
    return;
  }

  bool supported = bluetoothCapable;
  bool wasActive = supported && bluetoothEnabled;
  bool success = true;

  if (wasActive) {
    stopBluetooth();
  }

  bluetoothDeviceName = candidate;

  if (wasActive) {
    success = startBluetooth();
  }

  String message;
  if (!supported) {
    message = String(T().bluetooth_not_supported);
    success = false;
  } else {
    message = success ? String(T().bluetooth_updated) : String(T().bluetooth_error);
  }

  server.send(200, "application/json", buildBluetoothJSON(success, message));
}

void handleBluetoothReset() {
  ensureBluetoothName();
  bool supported = bluetoothCapable;
  bool wasActive = supported && bluetoothEnabled;
  bool success = true;

  if (wasActive) {
    stopBluetooth();
  }

  bluetoothDeviceName = defaultBluetoothName.length() > 0 ? defaultBluetoothName : String("ESP32 Diagnostic");

  if (wasActive) {
    success = startBluetooth();
  }

  String message;
  if (!supported) {
    message = String(T().bluetooth_not_supported);
    success = false;
  } else {
    message = success ? String(T().bluetooth_reset_done) : String(T().bluetooth_error);
  }

  server.send(200, "application/json", buildBluetoothJSON(success, message));
}

// ========== INTERFACE WEB PRINCIPALE MULTILINGUE ==========
void handleRoot() {
  collectDiagnosticInfo();
  collectDetailedMemory();

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "text/html; charset=utf-8", "");
  
  // CHUNK 1: HEAD + CSS
  String chunk = "<!DOCTYPE html><html lang='";
  chunk += (currentLanguage == LANG_FR) ? "fr" : "en";
  chunk += "'><head>";
  chunk += "<meta charset='UTF-8'><meta name='viewport' content='width=device-width, initial-scale=1.0'>";
  chunk += "<title>" + String(T().title) + " " + String(T().version) + String(DIAGNOSTIC_VERSION) + "</title>";


  chunk += "<style>";
  chunk += F(R"rawliteral(
:root{
  --gradient:linear-gradient(135deg,#312e81 0%,#7c3aed 100%);
  --bg-primary:#0f172a;
  --bg-surface:rgba(15,23,42,0.86);
  --bg-surface-alt:rgba(30,41,59,0.92);
  --border-glow:rgba(99,102,241,0.35);
  --border-muted:rgba(148,163,184,0.22);
  --text-primary:#f8fafc;
  --text-muted:#94a3b8;
  --accent:#38bdf8;
  --success:#22c55e;
  --warning:#facc15;
  --danger:#f87171;
  --radius:18px;
  --transition:all .25s ease;
}
*,*::before,*::after{box-sizing:border-box;margin:0;padding:0;}
body{
  font-family:'Inter',-apple-system,'Segoe UI',sans-serif;
  background:var(--gradient);
  color:var(--text-primary);
  min-height:100vh;
  padding:20px;
}
a{color:inherit;}
.app-shell{
  display:flex;
  flex-direction:column;
  gap:24px;
  min-height:calc(100vh - 48px);
}
.nav-wrapper{
  position:sticky;
  top:20px;
  z-index:95;
}
.nav-wrapper .masthead-card{
  background:var(--bg-surface);
  border-radius:var(--radius);
  box-shadow:0 25px 60px rgba(15,23,42,.45);
  border:1px solid var(--border-glow);
  display:flex;
  flex-direction:column;
  overflow:hidden;
  transition:var(--transition);
}
.nav-wrapper.is-sticky .masthead-card{
  box-shadow:0 30px 60px rgba(15,23,42,.6);
  border-color:rgba(148,163,184,0.28);
}
.app-header{
  padding:18px 24px;
  display:flex;
  flex-direction:column;
  gap:14px;
  background:transparent;
  border:none;
  box-shadow:none;
}
.masthead-divider{
  height:1px;
  background:rgba(148,163,184,0.18);
  margin:0 24px;
}
.masthead-nav{
  padding:16px 24px 12px;
  display:flex;
  flex-direction:column;
  gap:12px;
  background:rgba(148,163,184,0.04);
}
.inline-strip{
  border-top:1px solid rgba(148,163,184,0.18);
  background:rgba(148,163,184,0.08);
  padding:10px 24px;
  display:flex;
  align-items:center;
  justify-content:center;
}
.header-meta{
  display:flex;
  flex-wrap:wrap;
  justify-content:space-between;
  gap:16px;
  align-items:flex-start;
}
.branding{
  display:flex;
  flex-direction:column;
  gap:6px;
}
.branding .subtitle{
  text-transform:uppercase;
  letter-spacing:.28em;
  font-size:.7rem;
  color:var(--accent);
}
.branding h1{
  font-size:2rem;
  margin:0;
  line-height:1.2;
  display:flex;
  flex-wrap:wrap;
  align-items:center;
  gap:8px;
}
.branding .version-tag{
  font-size:1rem;
  font-weight:600;
  color:var(--text-muted);
}
.header-actions{
  display:flex;
  align-items:center;
  gap:12px;
  flex-wrap:wrap;
}
.lang-switcher{
  display:flex;
  background:rgba(255,255,255,0.06);
  border-radius:999px;
  padding:3px;
  border:1px solid var(--border-muted);
}
.lang-btn{
  border:none;
  background:transparent;
  color:var(--text-primary);
  font-weight:600;
  padding:6px 14px;
  border-radius:999px;
  cursor:pointer;
  transition:var(--transition);
  font-size:.9rem;
}
.lang-btn.active{
  background:var(--accent);
  color:#0f172a;
  box-shadow:0 8px 20px rgba(56,189,248,.3);
}
.status-chip{
  display:flex;
  align-items:center;
  gap:8px;
  padding:6px 12px;
  border-radius:999px;
  background:rgba(56,189,248,0.12);
  border:1px solid rgba(56,189,248,0.35);
  font-weight:600;
  font-size:.9rem;
}
.status-indicator{
  width:11px;
  height:11px;
  border-radius:50%;
  display:inline-block;
  background:var(--success);
  box-shadow:0 0 16px rgba(34,197,94,.55);
  transition:var(--transition);
}
.status-indicator.status-offline{
  background:var(--danger);
  box-shadow:0 0 16px rgba(248,113,113,.5);
}
.header-status{
  display:flex;
  flex-wrap:wrap;
  gap:12px;
  align-items:center;
}
.status-item{
  display:flex;
  align-items:center;
  gap:8px;
  background:var(--bg-surface-alt);
  border-radius:12px;
  padding:8px 12px;
  border:1px solid var(--border-muted);
  min-height:40px;
}
.status-item .status-label{
  font-size:.72rem;
  text-transform:uppercase;
  letter-spacing:.08em;
  color:var(--text-muted);
  font-weight:600;
}
.status-item .status-value{
  font-weight:600;
  color:var(--text-primary);
  display:flex;
  align-items:center;
  gap:8px;
  flex-wrap:wrap;
}
.status-dot{
  width:10px;
  height:10px;
  border-radius:50%;
  background:var(--success);
  box-shadow:0 0 12px rgba(34,197,94,.45);
  transition:var(--transition);
}
.status-dot.offline{
  background:var(--danger);
  box-shadow:0 0 12px rgba(248,113,113,.45);
}
.status-item a{
  color:var(--accent);
  text-decoration:none;
}
.status-item a:hover{
  text-decoration:underline;
}
.status-item .access-placeholder{
  opacity:.6;
}
.status-item .separator{
  opacity:.45;
}
.status-item.status-access{
  flex:1 1 280px;
}
.app-body{
  display:flex;
  flex-direction:column;
  gap:24px;
  flex:1;
}
.primary-nav{
  display:flex;
  flex-wrap:nowrap;
  gap:8px;
  background:var(--bg-surface);
  border-radius:var(--radius);
  padding:6px 10px;
  border:1px solid var(--border-glow);
  box-shadow:0 20px 48px rgba(15,23,42,.35);
  position:relative;
}
.nav-wrapper.is-sticky .primary-nav{
  box-shadow:0 22px 40px rgba(15,23,42,.55);
  border-color:rgba(148,163,184,0.28);
}
.nav-select{
  display:none;
  width:100%;
}
.nav-dropdown{
  width:100%;
  border-radius:12px;
  padding:10px 14px;
  background:var(--bg-surface);
  border:1px solid var(--border-glow);
  color:var(--text-primary);
  font-weight:600;
  box-shadow:0 18px 32px rgba(15,23,42,.4);
}
.nav-dropdown:focus{
  outline:2px solid var(--accent);
  outline-offset:2px;
}
.sr-only{
  position:absolute;
  width:1px;
  height:1px;
  padding:0;
  margin:-1px;
  overflow:hidden;
  clip:rect(0,0,0,0);
  white-space:nowrap;
  border:0;
}
@media (max-width:900px){
  .primary-nav{display:none;}
  .nav-select{display:block;}
  .nav-wrapper{padding:8px 0 10px;}
}
.nav-link{
  border:none;
  text-align:center;
  padding:6px 10px;
  border-radius:12px;
  color:var(--text-primary);
  background:rgba(148,163,184,0.08);
  font-weight:600;
  cursor:pointer;
  transition:var(--transition);
  display:flex;
  justify-content:center;
  align-items:center;
  gap:6px;
  text-decoration:none;
  flex:0 0 auto;
  min-width:118px;
  font-size:.85rem;
  line-height:1.2;
}
.nav-link .icon{font-size:1rem;}
.nav-link:hover{
  background:rgba(148,163,184,0.16);
  transform:translateY(-2px);
}
.nav-link.active{
  background:linear-gradient(120deg,#38bdf8,#818cf8);
  color:#0b1120;
  box-shadow:0 18px 30px rgba(56,189,248,.35);
}
.app-main{
  background:var(--bg-surface);
  border-radius:var(--radius);
  padding:24px;
  border:1px solid var(--border-muted);
  box-shadow:0 25px 60px rgba(15,23,42,.45);
}
.inline-message{
  min-height:24px;
  margin:0;
  padding:6px 18px;
  border-radius:999px;
  border:1px solid transparent;
  background:transparent;
  color:var(--text-muted);
  font-size:.9rem;
  display:flex;
  align-items:center;
  justify-content:center;
  opacity:0;
  visibility:hidden;
  transition:var(--transition);
}
.inline-strip .inline-message{
  border-color:rgba(148,163,184,0.14);
}
.inline-message.show{
  opacity:1;
  visibility:visible;
  background:rgba(148,163,184,0.14);
  border-color:rgba(148,163,184,0.18);
}
.inline-message.success{
  border-color:rgba(34,197,94,.45);
  background:rgba(34,197,94,.12);
  color:#bbf7d0;
}
.inline-message.error{
  border-color:rgba(248,113,113,.45);
  background:rgba(248,113,113,.12);
  color:#fecaca;
}
.warning-callout{
  border-radius:12px;
  border:1px solid rgba(250,204,21,0.35);
  background:rgba(250,204,21,0.12);
  color:#facc15;
  padding:12px 16px;
  margin:0 0 18px 0;
  font-size:.9rem;
  line-height:1.4;
}
.tab-container{
  display:flex;
  flex-direction:column;
  gap:24px;
}
.tab-content{display:none;}
.tab-content.active{display:block;}
.tab-content:target{display:block;}
.section{
  background:var(--bg-surface-alt);
  border-radius:var(--radius);
  padding:24px;
  border:1px solid var(--border-muted);
  box-shadow:0 12px 40px rgba(15,23,42,.35);
  margin-bottom:12px;
}
.section h2{
  display:flex;
  align-items:center;
  gap:12px;
  font-size:1.4rem;
  margin-bottom:12px;
  color:var(--accent);
}
.section-description{
  margin:-4px 0 18px;
  color:var(--text-muted);
  font-size:.92rem;
}
.section h3{
  font-size:1.15rem;
  margin:18px 0 12px;
  color:var(--text-primary);
}
.info-grid{
  display:grid;
  gap:16px;
  grid-template-columns:repeat(auto-fit,minmax(220px,1fr));
}
.info-item{
  background:rgba(148,163,184,0.12);
  padding:16px;
  border-radius:14px;
  border:1px solid rgba(148,163,184,0.18);
}
.info-label{
  font-size:.8rem;
  letter-spacing:.08em;
  text-transform:uppercase;
  color:var(--text-muted);
  margin-bottom:6px;
}
.info-value{
  font-size:1.05rem;
  font-weight:600;
}
.status-live{
  border-radius:12px;
  padding:12px;
  text-align:center;
  font-weight:600;
  background:rgba(148,163,184,0.12);
  border:1px solid rgba(148,163,184,0.18);
  color:var(--text-muted);
  margin-top:16px;
}
.status-live.success{
  color:#bbf7d0;
  background:rgba(34,197,94,0.12);
  border-color:rgba(34,197,94,0.45);
}
.status-live.error{
  color:#fecaca;
  background:rgba(248,113,113,0.12);
  border-color:rgba(248,113,113,0.45);
}
.btn{
  border:none;
  border-radius:12px;
  padding:12px 18px;
  font-weight:600;
  cursor:pointer;
  transition:var(--transition);
  display:inline-flex;
  align-items:center;
  gap:8px;
  color:#0b1120;
  background:rgba(148,163,184,0.2);
  margin:6px 4px 0 0;
}
.btn:hover{
  transform:translateY(-2px);
  box-shadow:0 12px 24px rgba(56,189,248,.2);
}
.btn-primary{background:linear-gradient(120deg,#38bdf8,#818cf8);}
.btn-success{background:linear-gradient(120deg,#4ade80,#22c55e);}
.btn-info{background:linear-gradient(120deg,#22d3ee,#38bdf8);}
.btn-danger{background:linear-gradient(120deg,#f87171,#ef4444);}
.btn-warning{background:linear-gradient(120deg,#fbbf24,#f97316);}
.btn-secondary{background:rgba(148,163,184,0.25);color:var(--text-primary);}
.progress-bar{
  background:rgba(148,163,184,0.2);
  border-radius:999px;
  height:16px;
  overflow:hidden;
  margin-top:12px;
}
.progress-fill{
  height:100%;
  border-radius:999px;
  background:linear-gradient(120deg,#38bdf8,#818cf8);
  text-align:center;
  font-size:.75rem;
  font-weight:600;
  color:#0b1120;
}
.gpio-grid{
  display:grid;
  grid-template-columns:repeat(auto-fit,minmax(90px,1fr));
  gap:12px;
  margin-top:18px;
}
.gpio-item{
  border-radius:12px;
  padding:14px;
  text-align:center;
  font-weight:600;
  background:rgba(148,163,184,0.18);
  border:1px solid rgba(148,163,184,0.28);
}
.gpio-ok{
  background:rgba(34,197,94,0.18);
  border-color:rgba(34,197,94,0.35);
}
.gpio-fail{
  background:rgba(248,113,113,0.18);
  border-color:rgba(248,113,113,0.35);
}
.wifi-list{
  display:grid;
  gap:12px;
  margin-top:18px;
}
.wifi-item{
  padding:16px;
  border-radius:14px;
  background:rgba(148,163,184,0.12);
  border:1px solid rgba(148,163,184,0.2);
  display:flex;
  justify-content:space-between;
  align-items:center;
  gap:16px;
  flex-wrap:wrap;
}
.card{
  background:rgba(148,163,184,0.12);
  border-radius:14px;
  padding:24px;
  border:1px solid rgba(148,163,184,0.2);
  text-align:center;
}
.footer{
  text-align:center;
  color:var(--text-muted);
  font-size:.85rem;
  margin-top:24px;
}
.update-indicator{
  position:fixed;
  right:24px;
  bottom:24px;
  background:linear-gradient(120deg,#38bdf8,#818cf8);
  color:#0b1120;
  padding:14px 20px;
  border-radius:14px;
  box-shadow:0 20px 40px rgba(56,189,248,.45);
  opacity:0;
  pointer-events:none;
  transition:var(--transition);
  font-weight:600;
}
.update-indicator.show{opacity:1;}
@media(max-width:1100px){
  body{padding:18px;}
  .primary-nav{padding:8px 10px;}
  .nav-link{min-width:140px;}
}
@media(max-width:640px){
  .app-header{padding:18px;}
  .branding h1{font-size:1.6rem;}
  .header-status{flex-direction:column;align-items:stretch;}
  .status-item{width:100%;}
  .nav-link{padding:10px 12px;}
  .app-main{padding:18px;}
}
)rawliteral");
  chunk += "</style></head><body>";
  server.sendContent(chunk);
  

  const char* updateLabel = T().updating;
  const char* connectionLabel = T().online;
  bool wifiConnected = (WiFi.status() == WL_CONNECTED);
  String wifiSummary = String(T().not_detected);
  if (diagnosticData.wifiSSID.length() > 0 && wifiConnected) {
    wifiSummary = diagnosticData.wifiSSID + " (" + String(diagnosticData.wifiRSSI) + " dBm)";
  }
  String wifiSummaryEscaped = htmlEscape(wifiSummary);
  String wifiOfflineEscaped = htmlEscape(String(T().not_detected));
  String wifiValueDisplay = wifiConnected ? wifiSummaryEscaped : wifiOfflineEscaped;
  String wifiDotClass = wifiConnected ? "status-dot" : "status-dot offline";
  String bluetoothSummary = getBluetoothSummaryLabel();
  String bluetoothSummaryEscaped = htmlEscape(bluetoothSummary);
  String bluetoothStatusText = getBluetoothStateLabel();
  String bluetoothStatusEscaped = htmlEscape(bluetoothStatusText);
  bool bluetoothActive = bluetoothCapable && bluetoothEnabled;
  String bluetoothDotClass = bluetoothActive ? "status-dot" : "status-dot offline";
  String bluetoothSupportedAttr = bluetoothCapable ? "true" : "false";
  String bluetoothDisabledText = htmlEscape(String(T().bluetooth_disabled));
  String bluetoothUnsupportedText = htmlEscape(String(T().bluetooth_not_supported));
  String bluetoothOfflineText = bluetoothCapable ? bluetoothDisabledText : bluetoothUnsupportedText;
  String bluetoothOnlineCombined = bluetoothStatusEscaped + " • " + bluetoothSummaryEscaped;
  String bluetoothDisplayText = bluetoothActive ? bluetoothOnlineCombined : bluetoothOfflineText;
  String bluetoothNameDisplay = diagnosticData.bluetoothName.length() > 0 ? diagnosticData.bluetoothName : defaultBluetoothName;
  String bluetoothNameEscaped = htmlEscape(bluetoothNameDisplay);
  bool bluetoothClientNow = false;
  uint32_t bluetoothNotifyDisplay = 0;
#if BLE_STACK_SUPPORTED
  bluetoothClientNow = bluetoothClientConnected;
  bluetoothNotifyDisplay = bluetoothNotifyCounter;
#endif
  bool bluetoothAdvertisingActive = bluetoothCapable && bluetoothEnabled && (bluetoothAdvertising
#if BLE_STACK_SUPPORTED
      || bluetoothClientNow
#endif
  );
  bool bluetoothConnectionActive = bluetoothCapable && bluetoothEnabled && bluetoothClientNow;
  String bluetoothSupportYes = htmlEscape(String(T().bluetooth_support_yes));
  String bluetoothSupportNo = htmlEscape(String(T().bluetooth_support_no));
  String bluetoothSupportValue = bluetoothCapable ? bluetoothSupportYes : bluetoothSupportNo;
  String bluetoothSupportAttr = bluetoothCapable ? "true" : "false";
  String bluetoothAdvertisingOn = htmlEscape(String(T().bluetooth_advertising));
  String bluetoothAdvertisingOff = htmlEscape(String(T().bluetooth_not_advertising));
  String bluetoothAdvertisingValue = bluetoothCapable ? (bluetoothAdvertisingActive ? bluetoothAdvertisingOn : bluetoothAdvertisingOff)
                                                      : htmlEscape(String(T().bluetooth_not_supported));
  String bluetoothAdvertisingAttr = bluetoothAdvertisingActive ? "true" : "false";
  String bluetoothConnectedLabel = htmlEscape(String(T().bluetooth_client_connected));
  String bluetoothDisconnectedLabel = htmlEscape(String(T().bluetooth_client_disconnected));
  String bluetoothConnectionValue = bluetoothConnectionActive ? bluetoothConnectedLabel : bluetoothDisconnectedLabel;
  String bluetoothConnectionStateAttr;
  if (!bluetoothCapable) {
    bluetoothConnectionStateAttr = "unsupported";
  } else if (!bluetoothEnabled) {
    bluetoothConnectionStateAttr = "disabled";
  } else if (bluetoothConnectionActive) {
    bluetoothConnectionStateAttr = "connected";
  } else {
    bluetoothConnectionStateAttr = "idle";
  }
  String bluetoothNotificationsValue = htmlEscape(String((unsigned long)bluetoothNotifyDisplay));
  String bluetoothDisableAttr = bluetoothCapable ? "" : " disabled";
  String bluetoothFeedbackText = bluetoothCapable ? "" : String(T().bluetooth_not_supported);
  // --- [BUGFIX] Retrait du doublon IP sur l'interface legacy ---
  bool ipAvailable = diagnosticData.ipAddress.length() > 0;
  String accessHost = diagnosticData.ipAddress;
  // --- [BUGFIX] Lien IP initial en HTTP ---
  String accessUrl = ipAvailable ? buildAccessUrl(accessHost) : String(T().not_detected);
  String accessUrlLegacy = ipAvailable ? buildAccessUrl(accessHost, false) : String();
  String accessUrlHref = ipAvailable ? accessUrl : String("#");
  String accessUrlEscaped = htmlEscape(accessUrl);
  String accessUrlLegacyEscaped = htmlEscape(accessUrlLegacy);
  String accessPlaceholder = htmlEscape(String(T().not_detected));
  bool mdnsAvailable = diagnosticData.mdnsAvailable;
  String stableAccessHost = getStableAccessHost();
  String stableAccessUrl = getStableAccessURL();
  String stableAccessLegacy = buildAccessUrl(stableAccessHost, false);
  String stableAccessEscaped = htmlEscape(stableAccessUrl);
  String stableAccessLegacyEscaped = htmlEscape(stableAccessLegacy);
  String stableAccessHostEscaped = htmlEscape(stableAccessHost);
  String accessHostEscaped = htmlEscape(accessHost);
  String stableAccessHref = mdnsAvailable ? stableAccessUrl : String("#");
  String mdnsStateAttr = mdnsAvailable ? "true" : "false";
  String secureSchemeEscaped = htmlEscape(String(DIAGNOSTIC_SECURE_SCHEME));
  String legacySchemeEscaped = htmlEscape(String(DIAGNOSTIC_LEGACY_SCHEME));

