morfredus/ESP32-Diagnostic-Arduino-IDE/ESP32-Diagnostic.ino
  chunk = "<div class='app-shell'>";
  chunk += "<div id='updateIndicator' class='update-indicator'>";
  chunk += updateLabel;
  chunk += "</div>";
  chunk += "<div class='app-body'>";
  chunk += "<div class='nav-wrapper'>";
  chunk += "<div class='masthead-card'>";
  chunk += "<header class='app-header'>";
  chunk += "<div class='header-meta'>";
  chunk += "<div class='branding'><h1 id='main-title'><span class='title-text' data-i18n='title'>" + String(T().title) + "</span><span class='version-tag'>" + String(T().version) + String(DIAGNOSTIC_VERSION) + "</span></h1></div>";
  chunk += "<div class='header-actions'>";
  chunk += "<div class='lang-switcher' role='group' aria-label='Langue'>";
  chunk += "<button type='button' class='lang-btn " + String(currentLanguage == LANG_FR ? "active" : "") + "' data-lang='fr' onclick='changeLang(\"fr\",this)'>FR</button>";
  chunk += "<button type='button' class='lang-btn " + String(currentLanguage == LANG_EN ? "active" : "") + "' data-lang='en' onclick='changeLang(\"en\",this)'>EN</button>";
  chunk += "</div>";
  chunk += "<div class='status-chip'><span class='status-indicator status-online' id='statusIndicator'></span><span id='connectionLabel'>";
  chunk += connectionLabel;
  chunk += "</span></div>";
  chunk += "</div></div>";
  chunk += "<div class='header-status'>";
  chunk += "<div class='status-item'><span class='status-label' data-i18n='wifi_connection'>" + String(T().wifi_connection) + "</span>";
  chunk += "<span id='wifiStatusDot' class='" + wifiDotClass + "' aria-hidden='true'></span>";
  chunk += "<span class='status-value' id='wifiStatusValue' data-online='" + wifiSummaryEscaped + "' data-offline='" + wifiOfflineEscaped + "'>" + wifiValueDisplay + "</span></div>";
  chunk += "<div class='status-item'><span class='status-label' data-i18n='bluetooth_section'>" + String(T().bluetooth_section) + "</span>";
  chunk += "<span id='bluetoothStatusDot' class='" + bluetoothDotClass + "' aria-hidden='true'></span>";
  chunk += "<span class='status-value' id='bluetoothSummary' data-online='" + bluetoothOnlineCombined + "' data-offline='" + bluetoothOfflineText + "' data-disabled='" + bluetoothDisabledText + "' data-unsupported='" + bluetoothUnsupportedText + "' data-supported='" + bluetoothSupportedAttr + "'>" + bluetoothDisplayText + "</span></div>";
  chunk += "<div class='status-item status-access'><span class='status-label' data-i18n='access'>" + String(T().access) + "</span>";
  chunk += "<span class='status-value' data-mdns='" + mdnsStateAttr + "'>";
  if (mdnsAvailable) {
    chunk += "<a href='" + stableAccessHref + "' target='_blank' rel='noopener' data-access-host='" + stableAccessHostEscaped +
             "' data-secure='" + secureSchemeEscaped + "' data-legacy='" + legacySchemeEscaped + "' data-access-label='" +
             stableAccessHostEscaped + "' data-legacy-label='" + stableAccessLegacyEscaped + "'>" + stableAccessEscaped + "</a>";
  } else {
    chunk += "<span>" + stableAccessEscaped + "</span>";
  }
  chunk += "<span class='separator'>•</span>";
  if (ipAvailable) {
    chunk += "<a href='" + accessUrlHref + "' target='_blank' rel='noopener' data-access-host='" + accessHostEscaped +
             "' data-secure='" + secureSchemeEscaped + "' data-legacy='" + legacySchemeEscaped + "' data-access-label='" +
             accessHostEscaped + "' data-legacy-label='" + accessUrlLegacyEscaped + "'>" + accessUrlEscaped + "</a>";
  } else {
    chunk += "<span class='access-placeholder'>" + accessPlaceholder + "</span>";
  }
  chunk += "</span></div>";
  chunk += "</div>";
  chunk += "</header>";
  chunk += "<div class='masthead-divider' role='presentation'></div>";
  chunk += "<div class='masthead-nav'>";
  chunk += "<nav class='primary-nav' data-role='nav'>";
  chunk += "<a href='#overview' class='nav-link active' data-target='overview' onclick=\"return showTab('overview',this);\"><span class='label' data-i18n='nav_overview'>" + String(T().nav_overview) + "</span><span class='icon'>🏠</span></a>";
  chunk += "<a href='#leds' class='nav-link' data-target='leds' onclick=\"return showTab('leds',this);\"><span class='label' data-i18n='nav_leds'>" + String(T().nav_leds) + "</span><span class='icon'>💡</span></a>";
  chunk += "<a href='#screens' class='nav-link' data-target='screens' onclick=\"return showTab('screens',this);\"><span class='label' data-i18n='nav_screens'>" + String(T().nav_screens) + "</span><span class='icon'>🖥️</span></a>";
  chunk += "<a href='#tests' class='nav-link' data-target='tests' onclick=\"return showTab('tests',this);\"><span class='label' data-i18n='nav_tests'>" + String(T().nav_tests) + "</span><span class='icon'>🧪</span></a>";
  chunk += "<a href='#gpio' class='nav-link' data-target='gpio' onclick=\"return showTab('gpio',this);\"><span class='label' data-i18n='nav_gpio'>" + String(T().nav_gpio) + "</span><span class='icon'>🔌</span></a>";
  chunk += "<a href='#wireless' class='nav-link' data-target='wireless' onclick=\"return showTab('wireless',this);\"><span class='label' data-i18n='nav_wireless'>" + String(T().nav_wireless) + "</span><span class='icon'>📡</span></a>";
  chunk += "<a href='#benchmark' class='nav-link' data-target='benchmark' onclick=\"return showTab('benchmark',this);\"><span class='label' data-i18n='nav_benchmark'>" + String(T().nav_benchmark) + "</span><span class='icon'>⚡</span></a>";
  chunk += "<a href='#export' class='nav-link' data-target='export' onclick=\"return showTab('export',this);\"><span class='label' data-i18n='nav_export'>" + String(T().nav_export) + "</span><span class='icon'>💾</span></a>";
  chunk += "</nav>";
  chunk += "<div class='nav-select'><label for='navSelector' class='sr-only' data-i18n='nav_select_label'>" + String(T().nav_select_label) + "</label>";
  chunk += "<select id='navSelector' class='nav-dropdown' aria-label='" + String(T().nav_select_label) + "'>";
  chunk += "<option value='overview' data-i18n='nav_overview' selected>" + String(T().nav_overview) + "</option>";
  chunk += "<option value='leds' data-i18n='nav_leds'>" + String(T().nav_leds) + "</option>";
  chunk += "<option value='screens' data-i18n='nav_screens'>" + String(T().nav_screens) + "</option>";
  chunk += "<option value='tests' data-i18n='nav_tests'>" + String(T().nav_tests) + "</option>";
  chunk += "<option value='gpio' data-i18n='nav_gpio'>" + String(T().nav_gpio) + "</option>";
  chunk += "<option value='wireless' data-i18n='nav_wireless'>" + String(T().nav_wireless) + "</option>";
  chunk += "<option value='benchmark' data-i18n='nav_benchmark'>" + String(T().nav_benchmark) + "</option>";
  chunk += "<option value='export' data-i18n='nav_export'>" + String(T().nav_export) + "</option>";
  chunk += "</select></div>";
  chunk += "</div>";
  chunk += "<div class='inline-strip'><div id='inlineMessage' class='inline-message' role='status' aria-live='polite'></div></div>";
  chunk += "</div></div>";
  chunk += "<main class='app-main'>";
  chunk += "<div id='tabContainer' class='tab-container'>";
  server.sendContent(chunk);
  // CHUNK 3: OVERVIEW TAB - VERSION UNIQUE COMPLÈTE
  chunk = "<div id='overview' class='tab-content active'>";
  
  // Chip Info
  chunk += "<div class='section'><h2 data-i18n='chip_info'>" + String(T().chip_info) + "</h2><div class='info-grid'>";
  String modelValue = diagnosticData.chipModel + " " + String(T().revision) + " " + diagnosticData.chipRevision;
  appendInfoItem(chunk, "full_model", T().full_model, modelValue);
  String cpuValue = String(diagnosticData.cpuCores) + " @ " + String(diagnosticData.cpuFreqMHz) + " MHz";
  appendInfoItem(chunk, "cpu_cores", T().cpu_cores, cpuValue);
  appendInfoItem(chunk, "mac_wifi", T().mac_wifi, diagnosticData.macAddress);
  appendInfoItem(chunk, "last_reset", T().last_reset, getResetReason());
  appendInfoItem(chunk, "chip_features", T().chip_features, getChipFeatures());
  appendInfoItem(chunk, "sdk_version", T().sdk_version, diagnosticData.sdkVersion);
  appendInfoItem(chunk, "idf_version", T().idf_version, diagnosticData.idfVersion);

  unsigned long seconds = diagnosticData.uptime / 1000;
  unsigned long minutes = seconds / 60;
  unsigned long hours = minutes / 60;
  unsigned long days = hours / 24;
  String uptimeAttrs = "id='uptime-display' data-days='" + String(days) + "' data-hours='" + String(hours % 24) + "' data-minutes='" + String(minutes % 60) + "'";
  appendInfoItem(chunk, "uptime", T().uptime, formatUptime(days, hours % 24, minutes % 60), uptimeAttrs);

  if (diagnosticData.temperature != -999) {
    String temperatureValue = String(diagnosticData.temperature, 1) + " °C";
    appendInfoItem(chunk, "cpu_temp", T().cpu_temp, temperatureValue);
  }
  chunk += "</div></div>";
  server.sendContent(chunk);
  
  // Memory - Flash
  chunk = "<div class='section'><h2 data-i18n='memory_details'>" + String(T().memory_details) + "</h2>";
  chunk += "<h3 data-i18n='flash_memory'>" + String(T().flash_memory) + "</h3><div class='info-grid'>";
  String flashReal = String(detailedMemory.flashSizeReal / 1048576.0, 2) + " MB";
  appendInfoItem(chunk, "real_size", T().real_size, flashReal);
  String flashConfigured = String(detailedMemory.flashSizeChip / 1048576.0, 2) + " MB";
  appendInfoItem(chunk, "configured_ide", T().configured_ide, flashConfigured);

