morfredus/ESP32-Diagnostic-Arduino-IDE/ESP32-Diagnostic.ino
  bool flashMatch = (detailedMemory.flashSizeReal == detailedMemory.flashSizeChip);
  String configValue = flashMatch ? "<span class='badge badge-success' data-i18n='correct'>" + String(T().correct)
                                  : "<span class='badge badge-warning' data-i18n='to_fix'>" + String(T().to_fix);
  configValue += "</span>";
  appendInfoItem(chunk, "configuration", T().configuration, configValue);
  appendInfoItem(chunk, "flash_type", T().flash_type, getFlashType());
  appendInfoItem(chunk, "flash_speed", T().flash_speed, getFlashSpeed());
  chunk += "</div>";
  server.sendContent(chunk);
  
  // Memory - PSRAM
  chunk = "<h3 data-i18n='psram_external'>" + String(T().psram_external) + "</h3><div class='info-grid'>";
  if (detailedMemory.psramAvailable) {
    String statusValue = "<span class='badge badge-success' data-i18n='detected_active'>" + String(T().detected_active) + "</span>";
    appendInfoItem(chunk, "hardware_status", T().hardware_status, statusValue);
    String psramTotal = String(detailedMemory.psramTotal / 1048576.0, 2) + " MB";
    appendInfoItem(chunk, "total_size", T().total_size, psramTotal);
    String psramFree = String(detailedMemory.psramFree / 1048576.0, 2) + " MB";
    appendInfoItem(chunk, "free", T().free, psramFree);
    String psramUsed = String(detailedMemory.psramUsed / 1048576.0, 2) + " MB";
    appendInfoItem(chunk, "used", T().used, psramUsed);
  } else if (detailedMemory.psramBoardSupported) {
    String statusValue = "<span class='badge badge-warning' data-i18n='supported_not_enabled'>" + String(T().supported_not_enabled) + "</span>";
    appendInfoItem(chunk, "hardware_status", T().hardware_status, statusValue);
    String psramHint = String(T().enable_psram_hint);
    psramHint.replace("%TYPE%", detailedMemory.psramType ? detailedMemory.psramType : "PSRAM");
    String psramHintAttrs = "data-i18n='enable_psram_hint' data-psram-type='" + htmlEscape(String(detailedMemory.psramType ? detailedMemory.psramType : "PSRAM")) + "'";
    appendInfoItem(chunk, "ide_config", T().ide_config, psramHint, psramHintAttrs, String(F("style='grid-column:1/-1'")));
  } else {
    String statusValue = "<span class='badge badge-danger' data-i18n='not_detected'>" + String(T().not_detected) + "</span>";
    appendInfoItem(chunk, "hardware_status", T().hardware_status, statusValue);
  }
  chunk += "</div>";
  server.sendContent(chunk);
  
  // Memory - SRAM
  chunk = "<h3 data-i18n='internal_sram'>" + String(T().internal_sram) + "</h3><div class='info-grid'>";
  String sramTotal = String(detailedMemory.sramTotal / 1024.0, 2) + " KB";
  appendInfoItem(chunk, "total_size", T().total_size, sramTotal);
  String sramFree = String(detailedMemory.sramFree / 1024.0, 2) + " KB";
  appendInfoItem(chunk, "free", T().free, sramFree);
  String sramUsed = String(detailedMemory.sramUsed / 1024.0, 2) + " KB";
  appendInfoItem(chunk, "used", T().used, sramUsed);
  String fragmentation = String(detailedMemory.fragmentationPercent, 1) + "%";
  appendInfoItem(chunk, "memory_fragmentation", T().memory_fragmentation, fragmentation);
  chunk += "</div>";
  chunk += "<div style='text-align:center;margin-top:15px'><button class='btn btn-info' data-i18n='refresh_memory' onclick='location.reload()'>" + String(T().refresh_memory) + "</button></div></div>";
  server.sendContent(chunk);
  
  // WiFi
  chunk = "<div class='section'><h2 data-i18n='wifi_connection'>" + String(T().wifi_connection) + "</h2><div class='info-grid'>";
  appendInfoItem(chunk, "connected_ssid", T().connected_ssid, diagnosticData.wifiSSID);
  String wifiRssi = String(diagnosticData.wifiRSSI) + " dBm";
  appendInfoItem(chunk, "signal_power", T().signal_power, wifiRssi);
  appendInfoItem(chunk, "signal_quality", T().signal_quality, getWiFiSignalQuality());
  appendInfoItem(chunk, "ip_address", T().ip_address, diagnosticData.ipAddress);
  appendInfoItem(chunk, "subnet_mask", T().subnet_mask, WiFi.subnetMask().toString());
  appendInfoItem(chunk, "gateway", T().gateway, WiFi.gatewayIP().toString());
  appendInfoItem(chunk, "bluetooth_section", T().bluetooth_section, bluetoothSummaryEscaped);
  appendInfoItem(chunk, "bluetooth_mac", T().bluetooth_mac, diagnosticData.bluetoothAddress);
  chunk += "</div></div>";
  server.sendContent(chunk);

  chunk = "<div class='section'><h2 data-i18n='bluetooth_section'>" + String(T().bluetooth_section) + "</h2><div class='info-grid'>";
  appendInfoItem(chunk, "bluetooth_status", T().bluetooth_status, bluetoothStatusEscaped);
  appendInfoItem(chunk, "bluetooth_name", T().bluetooth_name, bluetoothNameEscaped);
  appendInfoItem(chunk, "bluetooth_mac", T().bluetooth_mac, diagnosticData.bluetoothAddress);
  chunk += "</div></div>";
  server.sendContent(chunk);

  // GPIO et I2C
  chunk = "<div class='section'><h2 data-i18n='gpio_interfaces'>" + String(T().gpio_interfaces) + "</h2><div class='info-grid'>";
  String totalGPIOValue = String(diagnosticData.totalGPIO) + " " + String(T().pins);
  appendInfoItem(chunk, "total_gpio", T().total_gpio, totalGPIOValue);
  if (ENABLE_I2C_SCAN) {
    String i2cCountValue = String(diagnosticData.i2cCount) + " " + String(T().devices);
    appendInfoItem(chunk, "i2c_peripherals", T().i2c_peripherals, i2cCountValue);
    if (diagnosticData.i2cCount > 0) {
      appendInfoItem(chunk, "detected_addresses", T().detected_addresses, diagnosticData.i2cDevices, String(), String(F("style='grid-column:1/-1'")));
    }
  }
  chunk += "</div></div>";
  chunk += "</div>"; // Fermeture div overview
  server.sendContent(chunk);

  // CHUNK 4: TAB LEDs
  chunk = "<div id='leds' class='tab-content'>";
  chunk += "<div class='section'><h2 data-i18n='builtin_led'>" + String(T().builtin_led) + "</h2><div class='info-grid'>";
  String builtinPinValue = "GPIO " + String(BUILTIN_LED_PIN);
  appendInfoItem(chunk, nullptr, T().gpio, builtinPinValue);
  appendInfoItem(chunk, nullptr, T().status, builtinLedTestResult, String(F("id='builtin-led-status'")));
  chunk += "<div class='info-item' style='grid-column:1/-1;text-align:center'>";
  chunk += "<input type='number' id='ledGPIO' value='" + String(BUILTIN_LED_PIN) + "' min='0' max='48' style='width:80px'>";
  chunk += "<button class='btn btn-info' onclick='configBuiltinLED()'>" + String(T().config) + "</button>";
  chunk += "<button class='btn btn-primary' onclick='testBuiltinLED()'>" + String(T().test) + "</button>";
  chunk += "<button class='btn btn-success' onclick='ledBlink()'>" + String(T().blink) + "</button>";
  chunk += "<button class='btn btn-info' onclick='ledFade()'>" + String(T().fade) + "</button>";
  chunk += "<button class='btn btn-danger' onclick='ledOff()'>" + String(T().off) + "</button>";
  chunk += "</div></div></div>";
  
  chunk += "<div class='section'><h2 data-i18n='neopixel'>" + String(T().neopixel) + "</h2><div class='info-grid'>";
  String neoPinValue = "GPIO " + String(LED_PIN);
  appendInfoItem(chunk, nullptr, T().gpio, neoPinValue);
  appendInfoItem(chunk, nullptr, T().status, neopixelTestResult, String(F("id='neopixel-status'")));
  chunk += "<div class='info-item' style='grid-column:1/-1;text-align:center'>";
  chunk += "<input type='number' id='neoGPIO' value='" + String(LED_PIN) + "' min='0' max='48' style='width:80px'>";
  chunk += "<input type='number' id='neoCount' value='" + String(LED_COUNT) + "' min='1' max='100' style='width:80px'>";
  chunk += "<button class='btn btn-info' onclick='configNeoPixel()'>" + String(T().config) + "</button>";
  chunk += "<button class='btn btn-primary' onclick='testNeoPixel()'>" + String(T().test) + "</button>";
  chunk += "<button class='btn btn-primary' onclick='neoPattern(\"rainbow\")'>" + String(T().rainbow) + "</button>";
  chunk += "<input type='color' id='neoColor' value='#ff0000' style='height:48px'>";
  chunk += "<button class='btn btn-primary' onclick='neoCustomColor()'>" + String(T().color) + "</button>";
  chunk += "<button class='btn btn-danger' onclick='neoPattern(\"off\")'>" + String(T().off) + "</button>";
  chunk += "</div></div></div></div>";
  server.sendContent(chunk);
  
  // CHUNK 5: TAB Screens
  chunk = "<div id='screens' class='tab-content'>";
  chunk += "<div class='section'><h2 data-i18n='oled_screen'>" + String(T().oled_screen) + "</h2><div class='info-grid'>";
  appendInfoItem(chunk, nullptr, T().status, oledTestResult, String(F("id='oled-status'")));
  String oledPinsValue = "SDA:" + String(I2C_SDA) + " SCL:" + String(I2C_SCL);
  appendInfoItem(chunk, nullptr, T().i2c_pins, oledPinsValue, String(F("id='oled-pins'")));
  appendInfoItem(chunk, nullptr, T().rotation, String(oledRotation), String(F("id='oled-rotation-display'")));
  chunk += "<div class='info-item' style='grid-column:1/-1;text-align:center'>";
  chunk += "SDA: <input type='number' id='oledSDA' value='" + String(I2C_SDA) + "' min='0' max='48' style='width:70px'> ";
  chunk += "SCL: <input type='number' id='oledSCL' value='" + String(I2C_SCL) + "' min='0' max='48' style='width:70px'> ";
  chunk += String(T().rotation) + ": <select id='oledRotation' style='padding:10px;border:2px solid #ddd;border-radius:5px'>";
  for (int rot = 0; rot < 4; rot++) {
    chunk += "<option value='" + String(rot) + "'" + String(oledRotation == rot ? " selected" : "") + ">" + String(rot) + "</option>";
  }
  chunk += "</select> ";
  chunk += "<button class='btn btn-info' onclick='configOLED()'>" + String(T().apply_redetect) + "</button>";
  if (oledAvailable) {
    chunk += "<div style='margin-top:15px'>";
    chunk += "<button class='btn btn-primary' onclick='testOLED()'>" + String(T().full_test) + "</button>";
    chunk += "</div>";
    chunk += "<div class='oled-step-grid' style='margin-top:15px;display:grid;grid-template-columns:repeat(auto-fit,minmax(180px,1fr));gap:10px'>";
    chunk += "<button class='btn btn-secondary' onclick='oledStep(\"welcome\")'>" + String(T().oled_step_welcome) + "</button>";
    chunk += "<button class='btn btn-secondary' onclick='oledStep(\"big_text\")'>" + String(T().oled_step_big_text) + "</button>";
    chunk += "<button class='btn btn-secondary' onclick='oledStep(\"text_sizes\")'>" + String(T().oled_step_text_sizes) + "</button>";
    chunk += "<button class='btn btn-secondary' onclick='oledStep(\"shapes\")'>" + String(T().oled_step_shapes) + "</button>";
    chunk += "<button class='btn btn-secondary' onclick='oledStep(\"horizontal_lines\")'>" + String(T().oled_step_horizontal_lines) + "</button>";
    chunk += "<button class='btn btn-secondary' onclick='oledStep(\"diagonals\")'>" + String(T().oled_step_diagonals) + "</button>";
    chunk += "<button class='btn btn-secondary' onclick='oledStep(\"moving_square\")'>" + String(T().oled_step_moving_square) + "</button>";
    chunk += "<button class='btn btn-secondary' onclick='oledStep(\"progress_bar\")'>" + String(T().oled_step_progress_bar) + "</button>";
    chunk += "<button class='btn btn-secondary' onclick='oledStep(\"scroll_text\")'>" + String(T().oled_step_scroll_text) + "</button>";
    chunk += "<button class='btn btn-secondary' onclick='oledStep(\"final_message\")'>" + String(T().oled_step_final_message) + "</button>";
    chunk += "</div>";
    chunk += "<div style='margin-top:15px'>";
    chunk += "<input type='text' id='oledMsg' placeholder='" + String(T().custom_message) + "' style='width:250px;margin:0 5px'>";
    chunk += "<button class='btn btn-success' onclick='oledMessage()'>" + String(T().show_message) + "</button>";
    chunk += "</div>";
  }
  chunk += "</div></div></div></div>";
  server.sendContent(chunk);
  
