morfredus/ESP32-Diagnostic-Arduino-IDE/ESP32-Diagnostic.ino
  // CHUNK 6: TAB Tests
  chunk = "<div id='tests' class='tab-content'>";
  chunk += "<div class='section'><h2 data-i18n='i2c_peripherals'>" + String(T().i2c_peripherals) + "</h2><p class='section-description' data-i18n='i2c_desc'>" + String(T().i2c_desc) + "</p>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='scanI2C()'>" + String(T().rescan_i2c) + "</button>";
  chunk += "<div id='i2c-status' class='status-live'>" + String(T().click_button) + "</div>";
  chunk += "</div></div>";
  chunk += "<div class='section'><h2 data-i18n='adc_test'>" + String(T().adc_test) + "</h2><p class='section-description' data-i18n='adc_desc'>" + String(T().adc_desc) + "</p>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='testADC()'>" + String(T().test) + "</button>";
  chunk += "<div id='adc-status' class='status-live'>" + adcTestResult + "</div>";
  chunk += "</div><div id='adc-results' class='info-grid'></div></div>";
  
  chunk += "<div class='section'><h2 data-i18n='pwm_test'>" + String(T().pwm_test) + "</h2><p class='section-description' data-i18n='pwm_desc'>" + String(T().pwm_desc) + "</p>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='testPWM()'>" + String(T().test) + "</button>";
  chunk += "<div id='pwm-status' class='status-live'>" + pwmTestResult + "</div>";
  chunk += "</div></div>";
  
  chunk += "<div class='section'><h2 data-i18n='spi_bus'>" + String(T().spi_bus) + "</h2><p class='section-description' data-i18n='spi_desc'>" + String(T().spi_desc) + "</p>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='scanSPI()'>" + String(T().scan) + "</button>";
  chunk += "<div id='spi-status' class='status-live'>" + (spiInfo.length() > 0 ? spiInfo : String(T().click_button)) + "</div>";
  chunk += "</div></div>";
  
  chunk += "<div class='section'><h2 data-i18n='flash_partitions'>" + String(T().flash_partitions) + "</h2><p class='section-description' data-i18n='partitions_desc'>" + String(T().partitions_desc) + "</p>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='listPartitions()'>" + String(T().list_partitions) + "</button>";
  chunk += "</div><div id='partitions-results' style='background:#fff;color:#0b1120;padding:15px;border-radius:10px;font-family:monospace;white-space:pre-wrap;font-size:0.85em'>";
  chunk += partitionsInfo.length() > 0 ? partitionsInfo : String(T().click_button);
  chunk += "</div></div>";
  
  chunk += "<div class='section'><h2 data-i18n='memory_stress'>" + String(T().memory_stress) + "</h2><p class='section-description' data-i18n='stress_desc'>" + String(T().stress_desc) + "</p>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-danger' onclick='stressTest()'>" + String(T().start_stress) + "</button>";
  chunk += "<div id='stress-status' class='status-live'>" + stressTestResult + "</div>";
  chunk += "</div></div></div>";
  server.sendContent(chunk);
  
  // CHUNK 7: TAB GPIO
  chunk = "<div id='gpio' class='tab-content'>";
  chunk += "<div class='section'><h2 data-i18n='gpio_test'>" + String(T().gpio_test) + "</h2><p class='section-description' data-i18n='gpio_desc'>" + String(T().gpio_desc) + "</p>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='testAllGPIO()'>" + String(T().test_all_gpio) + "</button>";
  chunk += "<div id='gpio-status' class='status-live'>" + String(T().click_to_test) + "</div>";
  chunk += "</div>";
  chunk += "<div class='warning-callout' data-i18n='gpio_warning'>" + String(T().gpio_warning) + "</div>";
  chunk += "<div id='gpio-results' class='gpio-grid'></div></div></div>";
  server.sendContent(chunk);
  
  // CHUNK 8: TAB Wireless
  chunk = "<div id='wireless' class='tab-content'>";
  chunk += "<div class='section'><h2 data-i18n='wifi_scanner'>" + String(T().wifi_scanner) + "</h2><p class='section-description' data-i18n='wifi_desc'>" + String(T().wifi_desc) + "</p>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='scanWiFi()'>" + String(T().scan_networks) + "</button>";
  chunk += "<div id='wifi-status' class='status-live'>" + String(T().click_to_test) + "</div>";
  chunk += "</div><div id='wifi-results' class='wifi-list'></div></div>";
  chunk += "<div class='section'><h2 data-i18n='bluetooth_section'>" + String(T().bluetooth_section) + "</h2>";
  chunk += "<div class='info-grid'>";
  appendInfoItem(chunk, "bluetooth_status", T().bluetooth_status, htmlEscape(bluetoothStatusText), String(F("id='bluetooth-status'")));
  appendInfoItem(chunk, "bluetooth_name", T().bluetooth_name, bluetoothNameEscaped, String(F("id='bluetooth-name'")));
  appendInfoItem(chunk, "bluetooth_mac", T().bluetooth_mac, diagnosticData.bluetoothAddress, String(F("id='bluetooth-mac'")));
  String supportAttrs = "id='bluetooth-support' data-yes='" + bluetoothSupportYes + "' data-no='" + bluetoothSupportNo + "' data-supported='" + bluetoothSupportAttr + "'";
  appendInfoItem(chunk, "bluetooth_support_label", T().bluetooth_support_label, bluetoothSupportValue, supportAttrs);
  String advertisingAttrs = "id='bluetooth-advertising' data-on='" + bluetoothAdvertisingOn + "' data-off='" + bluetoothAdvertisingOff + "' data-active='" + bluetoothAdvertisingAttr + "'";
  appendInfoItem(chunk, "bluetooth_advertising_label", T().bluetooth_advertising_label, bluetoothAdvertisingValue, advertisingAttrs);
  String connectionAttrs = "id='bluetooth-connection' data-connected='" + bluetoothConnectedLabel + "' data-disconnected='" + bluetoothDisconnectedLabel + "' data-state='" + bluetoothConnectionStateAttr + "'";
  appendInfoItem(chunk, "bluetooth_connection_label", T().bluetooth_connection_label, bluetoothConnectionValue, connectionAttrs);
  appendInfoItem(chunk, "bluetooth_notifications_label", T().bluetooth_notifications_label, bluetoothNotificationsValue, String(F("id='bluetooth-notify-count'")));
  chunk += "</div>";
  chunk += "<div class='card' style='margin-top:20px'>";
  chunk += "<h3 data-i18n='bluetooth_actions'>" + String(T().bluetooth_actions) + "</h3>";
  chunk += "<div style='display:flex;flex-wrap:wrap;gap:10px;justify-content:center;margin-top:15px'>";
  chunk += "<button type='button' class='btn btn-success' data-i18n='bluetooth_enable' onclick=\"toggleBluetooth(true)\" data-bt-control='1'" + bluetoothDisableAttr + ">" + String(T().bluetooth_enable) + "</button>";
  chunk += "<button type='button' class='btn btn-warning' data-i18n='bluetooth_disable' onclick=\"toggleBluetooth(false)\" data-bt-control='1'" + bluetoothDisableAttr + ">" + String(T().bluetooth_disable) + "</button>";
  chunk += "<input type='text' id='bluetoothNameInput' data-bt-control='1' value='" + bluetoothNameEscaped + "' placeholder='" + String(T().bluetooth_placeholder) + "'" + bluetoothDisableAttr + ">";
  chunk += "<button type='button' class='btn btn-info' data-i18n='bluetooth_rename' onclick=\"renameBluetooth()\" data-bt-control='1'" + bluetoothDisableAttr + ">" + String(T().bluetooth_rename) + "</button>";
  chunk += "<button type='button' class='btn btn-danger' data-i18n='bluetooth_reset' onclick=\"resetBluetooth()\" data-bt-control='1'" + bluetoothDisableAttr + ">" + String(T().bluetooth_reset) + "</button>";
  chunk += "</div>";
  chunk += "<div id='bluetooth-feedback' class='status-live'>" + htmlEscape(bluetoothFeedbackText) + "</div>";
  chunk += "</div></div></div>";
  server.sendContent(chunk);
  
  // CHUNK 9: TAB Benchmark
  chunk = "<div id='benchmark' class='tab-content'>";
  chunk += "<div class='section'><h2 data-i18n='performance_bench'>" + String(T().performance_bench) + "</h2><p class='section-description' data-i18n='benchmark_desc'>" + String(T().benchmark_desc) + "</p>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='runBenchmarks()'>" + String(T().run_benchmarks) + "</button>";
  chunk += "</div><div id='benchmark-results' class='info-grid'>";
  appendInfoItem(chunk, "cpu_benchmark", T().cpu_benchmark, String(T().not_tested), String(F("id='cpu-bench'")));
  appendInfoItem(chunk, "memory_benchmark", T().memory_benchmark, String(T().not_tested), String(F("id='mem-bench'")));
  appendInfoItem(chunk, "cpu_performance", T().cpu_performance, String(F("-")), String(F("id='cpu-perf'")));
  appendInfoItem(chunk, "memory_speed", T().memory_speed, String(F("-")), String(F("id='mem-speed'")));
  chunk += "</div></div></div>";
  server.sendContent(chunk);
  
  // CHUNK 10: TAB Export
  chunk = "<div id='export' class='tab-content'>";
  chunk += "<div class='section'><h2 data-i18n='data_export'>" + String(T().data_export) + "</h2>";
  chunk += "<div style='display:grid;grid-template-columns:repeat(auto-fit,minmax(200px,1fr));gap:20px;margin-top:20px'>";
  chunk += "<div style='text-align:center;padding:30px;background:#fff;border-radius:10px;border:2px solid #667eea'>";
  chunk += "<h3 style='color:#667eea;margin-bottom:15px'>" + String(T().txt_file) + "</h3>";
  chunk += "<p style='font-size:0.9em;color:#666;margin-bottom:15px'>" + String(T().readable_report) + "</p>";
  chunk += "<a href='/export/txt' class='btn btn-primary'>" + String(T().download_txt) + "</a></div>";
  chunk += "<div style='text-align:center;padding:30px;background:#fff;border-radius:10px;border:2px solid #3a7bd5'>";
  chunk += "<h3 style='color:#3a7bd5;margin-bottom:15px'>" + String(T().json_file) + "</h3>";
  chunk += "<p style='font-size:0.9em;color:#666;margin-bottom:15px'>" + String(T().structured_format) + "</p>";
  chunk += "<a href='/export/json' class='btn btn-info'>" + String(T().download_json) + "</a></div>";
  chunk += "<div style='text-align:center;padding:30px;background:#fff;border-radius:10px;border:2px solid #56ab2f'>";
  chunk += "<h3 style='color:#56ab2f;margin-bottom:15px'>" + String(T().csv_file) + "</h3>";
  chunk += "<p style='font-size:0.9em;color:#666;margin-bottom:15px'>" + String(T().for_excel) + "</p>";
  chunk += "<a href='/export/csv' class='btn btn-success'>" + String(T().download_csv) + "</a></div>";
  chunk += "<div style='text-align:center;padding:30px;background:#fff;border-radius:10px;border:2px solid #667eea'>";
  chunk += "<h3 style='color:#667eea;margin-bottom:15px'>" + String(T().printable_version) + "</h3>";
  chunk += "<p style='font-size:0.9em;color:#666;margin-bottom:15px'>" + String(T().pdf_format) + "</p>";
  chunk += "<a href='/print' target='_blank' class='btn btn-primary'>" + String(T().open) + "</a></div>";
  chunk += "</div></div></div>";
  chunk += "</div>"; // Fermeture tabContainer
  chunk += "</main>";
  chunk += "</div>"; // Fermeture app-body
  chunk += "<footer class='footer'>ESP32 Diagnostic v" + String(DIAGNOSTIC_VERSION) + " • " + diagnosticData.chipModel + " • MAC " + diagnosticData.macAddress + "</footer>";
  chunk += "</div>"; // Fermeture app-shell
  server.sendContent(chunk);
  // CHUNK 11: JavaScript complet
  chunk = "<script>";
  chunk += "var currentLang='" + String(currentLanguage == LANG_FR ? "fr" : "en") + "';";
  chunk += "var connectionState=true;";
  chunk += "var ignoreHashChange=false;";
  chunk += "var navDropdown=null;";
  chunk += "function preferredAccessScheme(){return window.location.protocol==='https:'?'https://':'http://';}";
  // --- [NEW FEATURE] Harmonisation du schéma des liens d'accès ---
  chunk += "function applyAccessLinkScheme(){var links=document.querySelectorAll('[data-access-host]');if(!links||!links.length){return;}var preferSecure=(preferredAccessScheme()==='https://');for(var i=0;i<links.length;i++){var link=links[i];if(!link){continue;}var host=link.getAttribute('data-access-host');if(!host){continue;}var secure=link.getAttribute('data-secure')||'https://';var legacy=link.getAttribute('data-legacy')||'http://';var scheme=preferSecure?secure:legacy;var labelHost=link.getAttribute('data-access-label')||host;var legacyLabel=link.getAttribute('data-legacy-label');link.href=scheme+host;if(!preferSecure&&legacyLabel){link.textContent=legacyLabel;}else{link.textContent=scheme+labelHost;}}}";
  chunk += "document.documentElement.setAttribute('lang',currentLang);";
  chunk += "function tr(key,fr,en){var dict=window.translations||{};var value=dict&&dict[key];if(typeof value==='string'){return value;}if(currentLang==='fr'){return typeof fr!=='undefined'?fr:(typeof en!=='undefined'?en:key);}return typeof en!=='undefined'?en:(typeof fr!=='undefined'?fr:key);}";
  chunk += "function showInlineMessage(text,state){var holder=document.getElementById('inlineMessage');if(!holder){return;}holder.className='inline-message';if(!text){return;}holder.textContent=text;holder.classList.add('show');if(state){holder.classList.add(state);}}";
  chunk += "function clearInlineMessage(){var holder=document.getElementById('inlineMessage');if(!holder){return;}holder.className='inline-message';holder.textContent='';}";
  chunk += "function updateStatus(id,text,state){var el=document.getElementById(id);if(el){el.textContent=text;el.classList.remove('success','error');if(state){el.classList.add(state);}}if(state==='error'||state==='success'){showInlineMessage(text,state);}else if(text===''){clearInlineMessage();}}";
  chunk += "function connectionLabelText(online){return online?tr('online','En ligne','Online'):tr('offline','Hors ligne','Offline');}";
  chunk += "function updateStatusIndicator(online){connectionState=!!online;var indicator=document.getElementById('statusIndicator');var label=document.getElementById('connectionLabel');if(indicator){indicator.classList.remove('status-online','status-offline');indicator.classList.add(online?'status-online':'status-offline');}if(label){label.textContent=connectionLabelText(online);}var wifiDot=document.getElementById('wifiStatusDot');if(wifiDot){wifiDot.classList.remove('offline');if(!online){wifiDot.classList.add('offline');}}var wifiValue=document.getElementById('wifiStatusValue');if(wifiValue){var offlineText=wifiValue.getAttribute('data-offline');var onlineText=wifiValue.getAttribute('data-online');if(!online&&offlineText){wifiValue.textContent=offlineText;}else if(online&&onlineText){wifiValue.textContent=onlineText;}}if(!online){showInlineMessage(connectionLabelText(false)+' — '+tr('check_network','Vérifiez le réseau.','Check the network.'),'error');}else{clearInlineMessage();}}";
  chunk += "function updateUptimeDisplay(){var el=document.getElementById('uptime-display');if(!el){return;}var days=parseInt(el.getAttribute('data-days')||'0',10);var hours=parseInt(el.getAttribute('data-hours')||'0',10);var minutes=parseInt(el.getAttribute('data-minutes')||'0',10);var tr=window.translations||null;var dayLabel=(tr&&tr.days)?tr.days:(currentLang==='fr'?'jours':'days');var hourLabel=(tr&&tr.hours)?tr.hours:(currentLang==='fr'?'heures':'hours');var minuteLabel=(tr&&tr.minutes)?tr.minutes:(currentLang==='fr'?'minutes':'minutes');var pieces=[];if(days>0){pieces.push(days+' '+dayLabel);}if(hours>0||pieces.length){pieces.push(hours+' '+hourLabel);}if(minutes>0||pieces.length===0){pieces.push(minutes+' '+minuteLabel);}el.textContent=pieces.join(' ');}";

  chunk += "function updateBluetoothFeedback(message,state,notify){var box=document.getElementById('bluetooth-feedback');if(!box){return;}if(typeof message==='undefined'||message===null){message='';}box.textContent=message;box.classList.remove('success','error');if(state){box.classList.add(state);}if(notify&&message){if(state==='error'){showInlineMessage(message,'error');}else if(state==='success'){showInlineMessage(message,'success');}}else if(notify&&!message){clearInlineMessage();}}";
  chunk += "function applyBluetoothState(data,notify){if(!data){return;}var statusEl=document.getElementById('bluetooth-status');if(statusEl&&typeof data.status!=='undefined'){statusEl.textContent=data.status;}var nameEl=document.getElementById('bluetooth-name');if(nameEl&&typeof data.name!=='undefined'){nameEl.textContent=data.name;}var macEl=document.getElementById('bluetooth-mac');if(macEl&&typeof data.mac!=='undefined'){macEl.textContent=data.mac;}var input=document.getElementById('bluetoothNameInput');if(input&&typeof data.name!=='undefined'){input.value=data.name;}var summary=document.getElementById('bluetoothSummary');if(summary){summary.setAttribute('data-supported',(data.supported===false)?'false':'true');var offlineStored=summary.getAttribute('data-offline')||'';var disabledStored=summary.getAttribute('data-disabled')||offlineStored;var unsupportedStored=summary.getAttribute('data-unsupported')||offlineStored;if(data.supported===false){var unsupportedText=unsupportedStored||disabledStored||offlineStored;summary.textContent=unsupportedText;summary.setAttribute('data-offline',unsupportedText);}else if(data.enabled===false){var disabledText=disabledStored||offlineStored;summary.textContent=disabledText;summary.setAttribute('data-offline',disabledText);}else{var pieces=[];if(typeof data.status==='string'){pieces.push(data.status);}if(typeof data.summary==='string'){pieces.push(data.summary);}if(pieces.length){var combined=pieces.join(' • ');summary.textContent=combined;summary.setAttribute('data-online',combined);summary.setAttribute('data-offline',disabledStored||offlineStored);}}}var supported=(data.supported===false)?false:true;var supportEl=document.getElementById('bluetooth-support');if(supportEl){var yesText=supportEl.getAttribute('data-yes')||'';var noText=supportEl.getAttribute('data-no')||'';supportEl.setAttribute('data-supported',supported?'true':'false');if(supported&&yesText){supportEl.textContent=yesText;}else if(!supported&&noText){supportEl.textContent=noText;}}var advEl=document.getElementById('bluetooth-advertising');if(advEl){var onText=advEl.getAttribute('data-on')||'';var offText=advEl.getAttribute('data-off')||'';var advActive=supported&&data.enabled!==false&&(data.advertising===true||data.clientConnected===true);advEl.setAttribute('data-active',advActive?'true':'false');if(!supported){var unsupportedTextForAdv=(typeof noText!=='undefined'&&noText)?noText:offText;if(unsupportedTextForAdv){advEl.textContent=unsupportedTextForAdv;}}else if(advActive&&onText){advEl.textContent=onText;}else if(offText){advEl.textContent=offText;}}var connectionEl=document.getElementById('bluetooth-connection');if(connectionEl){var connectedText=connectionEl.getAttribute('data-connected')||'';var disconnectedText=connectionEl.getAttribute('data-disconnected')||'';var stateValue='unsupported';if(supported){if(data.enabled===false){stateValue='disabled';}else if(data.clientConnected===true){stateValue='connected';}else{stateValue='idle';}}connectionEl.setAttribute('data-state',stateValue);if(stateValue==='connected'&&connectedText){connectionEl.textContent=connectedText;}else if(disconnectedText){connectionEl.textContent=disconnectedText;}}var notifyEl=document.getElementById('bluetooth-notify-count');if(notifyEl){var count=(typeof data.notifyCount!=='undefined')?data.notifyCount:0;notifyEl.textContent=count;}";
  chunk += "var indicator=document.getElementById('bluetoothStatusDot');if(indicator){indicator.classList.remove('offline');if(data.supported===false||data.enabled===false){indicator.classList.add('offline');}}var controls=document.querySelectorAll('[data-bt-control=\"1\"]');if(controls&&controls.length){for(var i=0;i<controls.length;i++){controls[i].disabled=(data.supported===false);}}var message=(typeof data.message==='string')?data.message:'';var state=null;if(typeof data.success!=='undefined'){state=data.success?'success':'error';}if(notify){updateBluetoothFeedback(message,state,true);}else if(data.supported===false){updateBluetoothFeedback(message,'error',false);}else{updateBluetoothFeedback('',null,false);}}";
  chunk += "function refreshBluetoothStatus(showNotice){fetch('/api/bluetooth/status').then(function(r){return r.json();}).then(function(data){applyBluetoothState(data,showNotice);}).catch(function(err){var message=tr('bluetooth_error','Erreur Bluetooth','Bluetooth error')+': '+(err&&err.message?err.message:err);updateBluetoothFeedback(message,'error',showNotice);});}";
  chunk += "function toggleBluetooth(enable){updateBluetoothFeedback(enable?tr('bluetooth_enabling','Activation...','Enabling...'):tr('bluetooth_disabling','Désactivation...','Disabling...'),null,false);fetch('/api/bluetooth/toggle?state='+(enable?'on':'off')).then(function(r){return r.json();}).then(function(data){applyBluetoothState(data,true);}).catch(function(err){var message=tr('bluetooth_error','Erreur Bluetooth','Bluetooth error')+': '+(err&&err.message?err.message:err);updateBluetoothFeedback(message,'error',true);});return false;}";
  chunk += "function renameBluetooth(){var input=document.getElementById('bluetoothNameInput');if(!input){return false;}var value=input.value||'';if(!value.trim()){updateBluetoothFeedback(tr('bluetooth_invalid_name','Nom Bluetooth invalide','Invalid Bluetooth name'),'error',true);return false;}updateBluetoothFeedback(tr('bluetooth_updating','Mise à jour...','Updating...'),null,false);fetch('/api/bluetooth/name?name='+encodeURIComponent(value.trim())).then(function(r){return r.json();}).then(function(data){applyBluetoothState(data,true);}).catch(function(err){var message=tr('bluetooth_error','Erreur Bluetooth','Bluetooth error')+': '+(err&&err.message?err.message:err);updateBluetoothFeedback(message,'error',true);});return false;}";
  chunk += "function resetBluetooth(){updateBluetoothFeedback(tr('bluetooth_resetting','Réinitialisation...','Resetting...'),null,false);fetch('/api/bluetooth/reset').then(function(r){return r.json();}).then(function(data){applyBluetoothState(data,true);}).catch(function(err){var message=tr('bluetooth_error','Erreur Bluetooth','Bluetooth error')+': '+(err&&err.message?err.message:err);updateBluetoothFeedback(message,'error',true);});return false;}";

