morfredus/ESP32-Diagnostic-Arduino-IDE/ESP32-Diagnostic.ino
  chunk += "function changeLang(lang,btn){";
  chunk += "fetch('/api/set-language?lang='+lang).then(function(r){return r.json();}).then(function(d){";
  chunk += "if(!d.success){throw new Error(d.message||'lang');}";
  chunk += "currentLang=lang;";
  chunk += "document.documentElement.setAttribute('lang',lang);";
  chunk += "var langButtons=document.querySelectorAll('.lang-btn');";
  chunk += "for(var i=0;i<langButtons.length;i++){langButtons[i].classList.remove('active');}";
  chunk += "if(btn){btn.classList.add('active');}";
  chunk += "updateTranslations(true);";
  chunk += "}).catch(function(err){var message=err&&err.message?err.message:err;showInlineMessage(tr('language_switch_error','Erreur changement langue','Language switch error')+': '+message,'error');});";
  chunk += "return false;";
  chunk += "}";

  chunk += "function updateTranslations(showNotice){";
  chunk += "fetch('/api/get-translations').then(function(r){return r.json();}).then(function(translations){";
  chunk += "window.translations=translations;";
  chunk += "var indicator=document.getElementById('updateIndicator');if(indicator&&translations.updating){indicator.textContent=translations.updating;}";
  // --- [FIX] Préserver la fonction tr() lors du rafraîchissement des traductions ---
  chunk += "var mainTitle=document.getElementById('main-title');if(mainTitle){var versionSpan=mainTitle.querySelector('.version-tag');if(versionSpan){var versionLabel=(translations.version||'v');versionSpan.textContent=versionLabel+'" + String(DIAGNOSTIC_VERSION) + "';}}";
  chunk += "var nodes=document.querySelectorAll('[data-i18n]');";
  chunk += "for(var i=0;i<nodes.length;i++){var key=nodes[i].getAttribute('data-i18n');if(!key){continue;}var value=translations[key];if(typeof value==='undefined'){continue;}if(key==='enable_psram_hint'){var psramType=nodes[i].getAttribute('data-psram-type')||'';nodes[i].textContent=value.replace('%TYPE%',psramType);}else{nodes[i].textContent=value;}}";
  chunk += "if(translations.nav_select_label){var navLabel=document.querySelector('label[for=\\'navSelector\\']');if(navLabel){navLabel.textContent=translations.nav_select_label;}if(navDropdown){navDropdown.setAttribute('aria-label',translations.nav_select_label);}}";
  chunk += "var btInput=document.getElementById('bluetoothNameInput');if(btInput&&translations.bluetooth_placeholder){btInput.setAttribute('placeholder',translations.bluetooth_placeholder);}";
  chunk += "var wifiValue=document.getElementById('wifiStatusValue');if(wifiValue&&translations.not_detected){wifiValue.setAttribute('data-offline',translations.not_detected);if(!connectionState){wifiValue.textContent=translations.not_detected;}}";
  chunk += "var btSummary=document.getElementById('bluetoothSummary');if(btSummary){if(translations.bluetooth_disabled){btSummary.setAttribute('data-disabled',translations.bluetooth_disabled);}if(translations.bluetooth_not_supported){btSummary.setAttribute('data-unsupported',translations.bluetooth_not_supported);}var supported=btSummary.getAttribute('data-supported');var btDot=document.getElementById('bluetoothStatusDot');var offlineState=btDot&&btDot.classList.contains('offline');if(offlineState){var offlineText=(supported==='false')?(translations.bluetooth_not_supported||btSummary.getAttribute('data-offline')):(translations.bluetooth_disabled||btSummary.getAttribute('data-offline'));if(offlineText){btSummary.textContent=offlineText;btSummary.setAttribute('data-offline',offlineText);}}}";
  chunk += "var btSupport=document.getElementById('bluetooth-support');if(btSupport){if(translations.bluetooth_support_yes){btSupport.setAttribute('data-yes',translations.bluetooth_support_yes);}if(translations.bluetooth_support_no){btSupport.setAttribute('data-no',translations.bluetooth_support_no);}var supportState=btSupport.getAttribute('data-supported')==='true';var yesValue=btSupport.getAttribute('data-yes')||'';var noValue=btSupport.getAttribute('data-no')||'';if(supportState&&yesValue){btSupport.textContent=yesValue;}else if(!supportState&&noValue){btSupport.textContent=noValue;}}";
  chunk += "var btAdvert=document.getElementById('bluetooth-advertising');if(btAdvert){if(translations.bluetooth_advertising){btAdvert.setAttribute('data-on',translations.bluetooth_advertising);}if(translations.bluetooth_not_advertising){btAdvert.setAttribute('data-off',translations.bluetooth_not_advertising);}var advertActive=btAdvert.getAttribute('data-active')==='true';var advertOn=btAdvert.getAttribute('data-on')||'';var advertOff=btAdvert.getAttribute('data-off')||'';if(advertActive&&advertOn){btAdvert.textContent=advertOn;}else if(advertOff){btAdvert.textContent=advertOff;}}";
  chunk += "var btConnection=document.getElementById('bluetooth-connection');if(btConnection){if(translations.bluetooth_client_connected){btConnection.setAttribute('data-connected',translations.bluetooth_client_connected);}if(translations.bluetooth_client_disconnected){btConnection.setAttribute('data-disconnected',translations.bluetooth_client_disconnected);}var connState=btConnection.getAttribute('data-state');var connectedText=btConnection.getAttribute('data-connected')||'';var disconnectedText=btConnection.getAttribute('data-disconnected')||'';if(connState==='connected'&&connectedText){btConnection.textContent=connectedText;}else if(disconnectedText){btConnection.textContent=disconnectedText;}}";
  chunk += "refreshBluetoothStatus(false);";
  chunk += "updateStatusIndicator(connectionState);";
  chunk += "updateUptimeDisplay();";
  chunk += "if(showNotice){showInlineMessage(tr('language_updated','Langue mise à jour','Language updated'),'success');}";
  chunk += "}).catch(function(err){var message=err&&err.message?err.message:err;showInlineMessage(tr('translation_error','Erreur traduction','Translation error')+': '+message,'error');});";
  chunk += "}";

  chunk += "function findNavTrigger(el){while(el&&el.classList&&!el.classList.contains('nav-link')){el=el.parentElement;}if(el&&el.classList&&el.classList.contains('nav-link')){return el;}return null;}";
  chunk += "function showTab(tabId,trigger,updateHash){if(!tabId){return false;}if(tabId==='wifi'){tabId='wireless';}clearInlineMessage();var tabs=document.querySelectorAll('.tab-content');for(var i=0;i<tabs.length;i++){tabs[i].classList.remove('active');}var target=document.getElementById(tabId);if(target){target.classList.add('active');var main=document.querySelector('.app-main');if(main){var nav=document.querySelector('.nav-wrapper');var top=main.getBoundingClientRect().top+(window.pageYOffset||document.documentElement.scrollTop||0);var adjust=nav?nav.offsetHeight:0;var destination=top-adjust-8;if(destination<0){destination=0;}window.scrollTo(0,destination);}else if(typeof target.scrollIntoView==='function'){target.scrollIntoView(true);}}var buttons=document.querySelectorAll('.nav-link');for(var j=0;j<buttons.length;j++){buttons[j].classList.remove('active');buttons[j].removeAttribute('aria-current');}var actual=trigger;if(!actual||!actual.classList){var selector=\".nav-link[data-target='\"+tabId+\"']\";actual=document.querySelector(selector);}if(actual&&actual.classList){actual.classList.add('active');actual.setAttribute('aria-current','page');}if(navDropdown&&navDropdown.value!==tabId){navDropdown.value=tabId;}if(updateHash!==false){if(window.location.hash!=='#'+tabId){ignoreHashChange=true;window.location.hash=tabId;setTimeout(function(){ignoreHashChange=false;},0);}}return false;}";
  chunk += "function initStickyNav(){var wrapper=document.querySelector('.nav-wrapper');if(!wrapper||wrapper.getAttribute('data-sticky-init')==='1'){return;}wrapper.setAttribute('data-sticky-init','1');var apply=function(state){if(state){wrapper.classList.add('is-sticky');}else{wrapper.classList.remove('is-sticky');}};";
  chunk += "var computeThreshold=function(){var rect=wrapper.getBoundingClientRect();var scrollTop=window.pageYOffset||document.documentElement.scrollTop||0;var stickyOffset=parseInt(window.getComputedStyle(wrapper).top,10)||0;return rect.top+scrollTop-stickyOffset;};var threshold=computeThreshold();";
  chunk += "var onScroll=function(){var scroll=window.pageYOffset||document.documentElement.scrollTop||0;var state=scroll>=threshold;apply(state);};window.addEventListener('scroll',onScroll);window.addEventListener('resize',function(){threshold=computeThreshold();onScroll();});onScroll();}";
  chunk += "function initNavigation(){updateUptimeDisplay();var navs=document.querySelectorAll('.primary-nav');if(navs&&navs.length){for(var n=0;n<navs.length;n++){(function(nav){nav.addEventListener('click',function(evt){var source=evt.target||evt.srcElement;var button=findNavTrigger(source);if(!button){return;}evt.preventDefault();var targetTab=button.getAttribute('data-target');if(targetTab){showTab(targetTab,button);}});})(navs[n]);}}var select=document.getElementById('navSelector');navDropdown=select;if(select){select.addEventListener('change',function(evt){var value=evt.target.value;if(value){showTab(value,null);}});}var initial=window.location.hash?window.location.hash.substring(1):null;var defaultButton=document.querySelector('.nav-link.active');if(initial==='wifi'){initial='wireless';}if(!initial&&defaultButton){initial=defaultButton.getAttribute('data-target');}if(!initial){var list=document.querySelectorAll('.nav-link');if(list.length>0){initial=list[0].getAttribute('data-target');defaultButton=list[0];}}var initialButton=null;if(initial){initialButton=document.querySelector(\".nav-link[data-target='\"+initial+\"']\");}if(initial){showTab(initial,initialButton,false);}else{showTab('overview',null,false);}initStickyNav();updateStatusIndicator(connectionState);applyAccessLinkScheme();refreshBluetoothStatus(false);}";
  chunk += "window.addEventListener('hashchange',function(){if(ignoreHashChange){return;}var target=window.location.hash?window.location.hash.substring(1):'overview';if(target==='wifi'){target='wireless';}showTab(target,null,false);});";
  chunk += "if(document.readyState==='loading'){document.addEventListener('DOMContentLoaded',function(){initNavigation();applyAccessLinkScheme();});}else{initNavigation();applyAccessLinkScheme();}";

  chunk += "function configBuiltinLED(){var fallback=tr('gpio_invalid','GPIO invalide','Invalid GPIO');updateStatus('builtin-led-status',tr('configuring','Configuration...','Configuring...'),null);fetch('/api/builtin-led-config?gpio='+document.getElementById('ledGPIO').value).then(function(r){return r.json();}).then(function(d){var state=d.success?'success':'error';updateStatus('builtin-led-status',d.message||fallback,state);}).catch(function(e){updateStatus('builtin-led-status',tr('error_label','Erreur','Error')+': '+e,'error');});}";
  chunk += "function testBuiltinLED(){updateStatus('builtin-led-status',tr('testing','Test...','Testing...'),null);fetch('/api/builtin-led-test').then(function(r){return r.json();}).then(function(d){var state=d.success?'success':'error';var fallback=tr('test_failed','Test en échec','Test failed');updateStatus('builtin-led-status',d.result||fallback,state);}).catch(function(e){updateStatus('builtin-led-status',tr('error_label','Erreur','Error')+': '+e,'error');});}";
  chunk += "function ledBlink(){fetch('/api/builtin-led-control?action=blink').then(function(r){return r.json();}).then(function(d){updateStatus('builtin-led-status',d.message,d.success?'success':'error');}).catch(function(e){updateStatus('builtin-led-status',tr('error_label','Erreur','Error')+': '+e,'error');});}";
  chunk += "function ledFade(){fetch('/api/builtin-led-control?action=fade').then(function(r){return r.json();}).then(function(d){updateStatus('builtin-led-status',d.message,d.success?'success':'error');}).catch(function(e){updateStatus('builtin-led-status',tr('error_label','Erreur','Error')+': '+e,'error');});}";
  chunk += "function ledOff(){fetch('/api/builtin-led-control?action=off').then(function(r){return r.json();}).then(function(d){updateStatus('builtin-led-status',d.message,d.success?'success':'error');}).catch(function(e){updateStatus('builtin-led-status',tr('error_label','Erreur','Error')+': '+e,'error');});}";

