morfredus/ESP32-Diagnostic-Arduino-IDE/ESP32-Diagnostic.ino
  chunk += "function configNeoPixel(){updateStatus('neopixel-status',tr('configuring','Configuration...','Configuring...'),null);fetch('/api/neopixel-config?gpio='+document.getElementById('neoGPIO').value+'&count='+document.getElementById('neoCount').value).then(function(r){return r.json();}).then(function(d){updateStatus('neopixel-status',d.message,d.success?'success':'error');}).catch(function(e){updateStatus('neopixel-status',tr('error_label','Erreur','Error')+': '+e,'error');});}";
  chunk += "function testNeoPixel(){updateStatus('neopixel-status',tr('testing','Test...','Testing...'),null);fetch('/api/neopixel-test').then(function(r){return r.json();}).then(function(d){updateStatus('neopixel-status',d.result,d.success?'success':'error');}).catch(function(e){updateStatus('neopixel-status',tr('error_label','Erreur','Error')+': '+e,'error');});}";
  chunk += "function neoPattern(p){fetch('/api/neopixel-pattern?pattern='+p).then(function(r){return r.json();}).then(function(d){updateStatus('neopixel-status',d.message,d.success?'success':'error');}).catch(function(e){updateStatus('neopixel-status',tr('error_label','Erreur','Error')+': '+e,'error');});}";
  chunk += "function neoCustomColor(){var c=document.getElementById('neoColor').value;var r=parseInt(c.substr(1,2),16);var g=parseInt(c.substr(3,2),16);var b=parseInt(c.substr(5,2),16);updateStatus('neopixel-status','RGB('+r+','+g+','+b+')...',null);fetch('/api/neopixel-color?r='+r+'&g='+g+'&b='+b).then(function(rsp){return rsp.json();}).then(function(d){updateStatus('neopixel-status',d.message,d.success?'success':'error');}).catch(function(e){updateStatus('neopixel-status',tr('error_label','Erreur','Error')+': '+e,'error');});}";

  chunk += "function testOLED(){updateStatus('oled-status',tr('oled_test_running','Test en cours (25s)...','Testing (25s)...'),null);fetch('/api/oled-test').then(function(r){return r.json();}).then(function(d){updateStatus('oled-status',d.result,d.success?'success':'error');}).catch(function(e){updateStatus('oled-status',tr('error_label','Erreur','Error')+': '+e,'error');});}";
  chunk += "function oledStep(step){updateStatus('oled-status','" + String(T().testing) + "',null);fetch('/api/oled-step?step='+step).then(function(r){return r.json();}).then(function(d){updateStatus('oled-status',d.message,d.success?'success':'error');}).catch(function(e){updateStatus('oled-status',tr('error_label','Erreur','Error')+': '+e,'error');});}";
  chunk += "function oledMessage(){var msg=document.getElementById('oledMsg').value;if(!msg){updateStatus('oled-status','" + String(T().custom_message) + "','error');return;}updateStatus('oled-status',tr('transmission','Transmission...','Transmitting...'),null);fetch('/api/oled-message?message='+encodeURIComponent(msg)).then(function(r){return r.json();}).then(function(d){updateStatus('oled-status',d.message,d.success?'success':'error');}).catch(function(e){updateStatus('oled-status',tr('error_label','Erreur','Error')+': '+e,'error');});}";
  chunk += "function configOLED(){updateStatus('oled-status',tr('reconfiguring','Reconfiguration...','Reconfiguring...'),null);var params='sda='+document.getElementById('oledSDA').value+'&scl='+document.getElementById('oledSCL').value+'&rotation='+document.getElementById('oledRotation').value;fetch('/api/oled-config?'+params).then(function(r){return r.json();}).then(function(d){var state=d.success?'success':'error';var fallback=tr('configuration_invalid','Configuration invalide','Invalid configuration');updateStatus('oled-status',d.message||fallback,state);if(d.success&&typeof d.sda!=='undefined'){document.getElementById('oledSDA').value=d.sda;}if(d.success){var pins=document.getElementById('oled-pins');if(pins){pins.textContent='SDA:'+d.sda+' SCL:'+d.scl;}}if(d.success){var rotDisplay=document.getElementById('oled-rotation-display');if(rotDisplay){rotDisplay.textContent=d.rotation;}}}).catch(function(e){updateStatus('oled-status',tr('error_label','Erreur','Error')+': '+e,'error');});}";

  // --- [FIX] Normalisation JS tests ADC/GPIO/WiFi ---
  chunk += "function testADC(){";
  chunk += "document.getElementById('adc-status').innerHTML=tr('testing','Test...','Testing...');";
  chunk += "fetch('/api/adc-test').then(function(r){return r.json();}).then(function(data){";
  chunk += "var h='';";
  chunk += "if(data.readings&&data.readings.forEach){data.readings.forEach(function(a){";
  chunk += "h+=\"<div class='info-item'><div class='info-label'>GPIO \"+a.pin+\"</div><div class='info-value'>\"+a.raw+\" (\"+a.voltage.toFixed(2)+\"V)</div></div>\";";
  chunk += "});}";
  chunk += "document.getElementById('adc-results').innerHTML=h;";
  chunk += "document.getElementById('adc-status').innerHTML=data.result;";
  chunk += "});";
  chunk += "}";
  chunk += "function testPWM(){document.getElementById('pwm-status').innerHTML=tr('testing','Test...','Testing...');fetch('/api/pwm-test').then(function(r){return r.json();}).then(function(d){document.getElementById('pwm-status').innerHTML=d.result;});}";
  chunk += "function scanSPI(){document.getElementById('spi-status').innerHTML=tr('scan','Scan...','Scan...');fetch('/api/spi-scan').then(function(r){return r.json();}).then(function(d){document.getElementById('spi-status').innerHTML=d.info;});}";
  chunk += "function listPartitions(){document.getElementById('partitions-results').innerHTML=tr('scan','Scan...','Scan...');fetch('/api/partitions-list').then(function(r){return r.json();}).then(function(d){document.getElementById('partitions-results').innerHTML=d.partitions;});}";
  chunk += "function stressTest(){document.getElementById('stress-status').innerHTML=tr('testing','Test...','Testing...');fetch('/api/stress-test').then(function(r){return r.json();}).then(function(d){document.getElementById('stress-status').innerHTML=d.result;});}";

  chunk += "function testAllGPIO(){";
  chunk += "document.getElementById('gpio-status').innerHTML=tr('testing','Test...','Testing...');";
  chunk += "fetch('/api/test-gpio').then(function(r){return r.json();}).then(function(data){";
  chunk += "var h='';";
  chunk += "if(data.results&&data.results.forEach){data.results.forEach(function(g){";
  chunk += "h+=\"<div class='gpio-item \"+(g.working?\"gpio-ok\":\"gpio-fail\")+\"'>GPIO \"+g.pin+\"<br>\"+(g.working?\"OK\":\"FAIL\")+\"</div>\";";
  chunk += "});}";
  chunk += "document.getElementById('gpio-results').innerHTML=h;";
  chunk += "var template=tr('gpio_summary_template','Terminé - %COUNT% GPIO testés','Done - %COUNT% GPIO tested');";
  chunk += "document.getElementById('gpio-status').innerHTML=template.replace('%COUNT%',data.results.length);";
  chunk += "});";
  chunk += "}";
  chunk += "function scanWiFi(){";
  chunk += "document.getElementById('wifi-status').innerHTML=tr('scan','Scan...','Scan...');";
  chunk += "fetch('/api/wifi-scan').then(function(r){return r.json();}).then(function(data){";
  chunk += "var h='';";
  chunk += "if(data.networks&&data.networks.forEach){data.networks.forEach(function(n){";
  chunk += "var s=n.rssi>=-60?'🟢':(n.rssi>=-70?'🟡':'🔴');";
  chunk += "var freq=(n.freq&&n.freq>0)?n.freq+' MHz':'';";
  chunk += "var pieces=[];";
  chunk += "if(n.bssid){pieces.push(n.bssid);}";
  chunk += "if(n.channel){pieces.push('Ch'+n.channel);}";
  chunk += "if(n.band){pieces.push(n.band);}";
  chunk += "if(freq){pieces.push(freq);}";
  chunk += "if(n.bandwidth){pieces.push(n.bandwidth);}";
  chunk += "if(n.phy){pieces.push(n.phy);}";
  chunk += "if(n.encryption&&n.encryption!=='-'){pieces.push(n.encryption);}";
  chunk += "var details=pieces.join(' | ');";
  chunk += "h+=\"<div class='wifi-item'><div style='display:flex;justify-content:space-between'><div><strong>\"+s+\" \"+n.ssid+\"</strong><br><small>\"+details+\"</small></div><div style='font-size:1.2em;font-weight:bold'>\"+n.rssi+\" dBm</div></div></div>\";";
  chunk += "});}";
  chunk += "document.getElementById('wifi-results').innerHTML=h;";
  chunk += "var wifiLabel=tr('wifi_networks_found','%COUNT% réseaux détectés','%COUNT% networks found');";
  chunk += "document.getElementById('wifi-status').innerHTML=wifiLabel.replace('%COUNT%',data.networks.length);";
  chunk += "});";
  chunk += "}";
  chunk += "function scanI2C(){updateStatus('i2c-status',tr('scan','Scan...','Scan...'),null);fetch('/api/i2c-scan').then(function(r){return r.json();}).then(function(d){var label=tr('i2c_scan_result','I2C : %COUNT% périphérique(s)','I2C: %COUNT% device(s)');updateStatus('i2c-status',label.replace('%COUNT%',d.count),'success');var summary=document.getElementById('i2c-summary');if(summary){var countLabel=tr('device_count','Nombre de Périphériques','Device count');summary.textContent=d.count+' '+countLabel+' - '+d.devices;}}).catch(function(e){updateStatus('i2c-status',tr('error_label','Erreur','Error')+': '+e,'error');});}";

  chunk += "function runBenchmarks(){document.getElementById('cpu-bench').innerHTML='Test...';document.getElementById('mem-bench').innerHTML='Test...';fetch('/api/benchmark').then(function(r){return r.json();}).then(function(data){document.getElementById('cpu-bench').innerHTML=data.cpu+' us';document.getElementById('mem-bench').innerHTML=data.memory+' us';document.getElementById('cpu-perf').innerHTML=data.cpuPerf.toFixed(2)+' MFLOPS';document.getElementById('mem-speed').innerHTML=data.memSpeed.toFixed(2)+' MB/s';});}";

